{
 "Quora-110447": "What sport should I try out?",
 "Quora-123845": "What is the point of a tattoo?",
 "Quora-122123": "If we don&#039;t take revenge, how will they learn from their mistakes?",
 "Quora-055749": "Do people driving Corvettes get more attention from police?",
 "Quora-236638": "What&#039;s so scary about &quot;being cheated on&quot;?",
 "Quora-010393": "What will happen if woman takes Viagra?",
 "Quora-199802": "Is it conceivable, that Melania Trump is in fact a Russian agent, or can that be ruled out as just another crazy conspiracy theory?",
 "Quora-226856": "Which fruit to eat in empty stomach?",
 "Quora-234299": "My mom just bought me &quot;The Metaphysics of Evolution&quot; by Father Chad Ripperger. Is this a trustworthy book?",
 "Quora-146705": "How many states are there in Pakistan?",
 "Quora-127445": "Does a 4.2 W GPA and 3.85 UW GPA show Harvard I can do the work?",
 "Quora-032746": "My boyfriend never buys me any gifts. Is it normal if I feel upset?",
 "Quora-083748": "As a conservative what bothers you about other conservatives?",
 "Quora-080717": "What was the first form of life on earth?",
 "Quora-184902": "In Star Wars, why does Darth Vader not murder the emperor and seize the throne?",
 "Quora-293673": "How do you know how physically attractive you are?",
 "Quora-141310": "Why do some people try to prove 2+2 to equal 5?",
 "Quora-160333": "Am I forced to donate blood when asked?",
 "Quora-104246": "What shocks you most on/about Quora?",
 "Quora-168679": "What does the world think about Indonesia?",
 "Quora-100803": "When is it acceptable for startup founders to draw market rate salary?",
 "Quora-213632": "How do I promote an android app?",
 "Quora-120130": "Why does my friend not gain any weight eating and drinking junk food?",
 "Quora-077051": "What are the things that matter in life?",
 "Quora-172856": "Did Uber and Airbnb grow ethically? Why or why not?",
 "Quora-138697": "How do I improve my English writing skill?",
 "Quora-227252": "What was the most perceptive , spot-on thing you heard someone say about Trump?",
 "Quora-231051": "Can you play a videogame &quot;wrong&quot;?",
 "Quora-217587": "Why do US Americans eat omelets for breakfast instead of for dinner?",
 "Quora-207056": "Why can life be hard sometimes?",
 "Quora-092729": "Is there any one who has cleared IIT JEE without any coaching?",
 "Quora-017827": "Why are some people afraid of death?",
 "Quora-167015": "How can I learn CS at the level of (relatively speaking) Mark Zuckerberg, Elon Musk, Bill Gates, etc.?",
 "Quora-289751": "In America, when did women/girls stop covering their hair?",
 "Quora-291311": "What is your Harry Potter House?",
 "Quora-056787": "Why do kids look so old in high school movies? Can&#039;t they find high school aged kids to act?",
 "Quora-258180": "Why is the US president called leader of the free world?",
 "Quora-253500": "How do I become a full stack developer?",
 "Quora-088897": "What would be the effect on earth if the moon was destroyed?",
 "Quora-158717": "What&#039;s a good way to get stronger?",
 "Quora-008101": "Why is cereal such a huge thing on the US?",
 "Quora-248496": "Does the new H1B wage limit of 130k apply to all states?",
 "Quora-177072": "How can you design a new programming language?",
 "Quora-202595": "How can I grow bigger breasts?",
 "Quora-008133": "Should I allow my 16-year-old daughter to visit her boyfriend&#039;s house?",
 "Quora-233666": "What effect would occur if I stopped eating everything but chicken nuggets?",
 "Quora-125469": "What can instantly ruin your day?",
 "Quora-263533": "My girlfriend still wears clothes that she&#039;s taken from previous boyfriends, including a sweatshirt to keep her warm. Is this normal/okay?",
 "Quora-285492": "What was Mahatma Gandhi&#039; s profession?",
 "Quora-101396": "How did the Soviet Union get Nukes?",
 "Quora-178851": "Is getting a CCNA certificate enough to be employable?",
 "Quora-242625": "Who was the smartest US President in American history?",
 "Quora-150299": "Despite her average writing skills, why is Anupriya Singh so popular in Quora?",
 "Quora-051400": "How can a restaurant earn a profit from eat-all-you-can buffet offer?",
 "Quora-284631": "What is the best way to remove pubic hair?",
 "Quora-241630": "Do psychopaths like submissive people?",
 "Quora-294037": "How do I increase my stamina?",
 "Quora-267558": "Why aren&#039;t atheists vegetarians?",
 "Quora-094242": "How can I be an entrepreneur.?",
 "Quora-218187": "I don&#039;t believe in god but I believe in an afterlife. What am I?",
 "Quora-098413": "What makes my boyfriend&#039;s insomnia go away whenever I sleep with him?",
 "Quora-127084": "Have someone ever asked you for sex?",
 "Quora-093211": "What is the best for study in day and night?",
 "Quora-071611": "Is there an inevitable conflict between science and religion?",
 "Quora-250315": "Is it smart to buy a used car?",
 "Quora-233799": "Do you think a sociopath is born that way?",
 "Quora-231662": "Why does the world turn silent when India set up genocide in Kashmir?",
 "Quora-281590": "How do you tolerate pain during torture sessions?",
 "Quora-280658": "Why do Chinese Communist leaders willingly give up their autocratic powers after their 10 year term?",
 "Quora-288160": "What is the most chill country in the world?",
 "Quora-085955": "How do I learn the English very fast?",
 "Quora-061358": "When will our civilisation fall?",
 "Quora-286821": "What is the greatest myth about smart phones?",
 "Quora-072135": "Why did Jaime fall in love with Cersei?",
 "Quora-135181": "What are some reasons American consumers dislike Whole Foods market?",
 "Quora-185541": "If Hitler was so bad, why didn&#039;t people around him just kill him?",
 "Quora-232833": "Is it a crime to be an undocumented immigrant?",
 "Quora-249774": "Why do so many people like Harry Potter and the Prisoner of Azkaban?",
 "Quora-254817": "What does Tourette’s Syndrome feel like?",
 "Quora-240803": "What is your weirdest pet peeve ever?",
 "Quora-126498": "How do fighter/attack aircraft avoid forming contrails that can be seen from afar?",
 "Quora-136052": "Doesn&#039;t Earth become unstable when a space rocket is launched into space since the rocket is made from mass of the Earth?",
 "Quora-072760": "Is it a good idea to make salaried employees clock in?",
 "Quora-282971": "Why do some people think I hate them?",
 "Quora-095704": "Can a 10th grader write a novel?",
 "Quora-018454": "How can I build my body without gym?",
 "Quora-022206": "What is the point of sentencing someone to 99 years in prison when you can just sentence them for life?",
 "Quora-050596": "Have you experienced Deja vu?",
 "Quora-171125": "How do I explain to my son why he shouldn&#039;t use his left hand despite being naturally left-handed dominant?",
 "Quora-203291": "How do I create a website and make money from it?",
 "Quora-254910": "Why are so few people willing to be an organ donor when they die?",
 "Quora-051909": "Should I purchase the Redmi note 3?",
 "Quora-195686": "What is the likelihood of Donald Trump being impeached?",
 "Quora-084051": "What are the reasons for Dropbox to build its own infrastructure and data center (i.e., moving away from AWS)?",
 "Quora-163796": "Will you marry a girl who is not a Virgin?",
 "Quora-070658": "What is the worst thing that happened to you?",
 "Quora-200963": "Why did the United States help Japan instead of leaving them for the Russians after all of the atrocities they&#039;ve done in WW2?",
 "Quora-264537": "What would happen if Queen Elizabeth drove a car in Saudi Arabia?",
 "Quora-190840": "Should I tell my startup how they can succeed, even though they are &quot;showing me the door&quot;?",
 "Quora-271812": "Is Russia an Asian country or a European country?",
 "Quora-203841": "Who is the best doctor for liver cancer in Mumbai and can be easily contacted in the hospital?",
 "Quora-268012": "I think my brother is a closeted homosexual. How do I confront him without hurting his feelings?",
 "Quora-289404": "Is it a big deal for men if a woman you like irons your shirts and pants before you go to work?",
 "Quora-033432": "Does Wikipedia collaborate or associate with Wikileaks in any way?",
 "Quora-255490": "Why was Chamberlain at first so easily duped by Hitler?",
 "Quora-160957": "Is it legal to forge a bladed weapon in the United Kingdom?",
 "Quora-233722": "What would happen to a fighter jet if it decided to go to space?",
 "Quora-170678": "Is the claim true that GPS devices have a piece of code in them that undoes the relativity correction because relativity is a hoax?",
 "Quora-079759": "Why does Singapore allow Israel PM to visit them on February 19, despite knowing that it would anger their neighbors, Malaysia and Indonesia?",
 "Quora-232981": "One of our new hires works 40 hours straight so he can have 5 days off each week. Should I stop him or is that wrong?",
 "Quora-214456": "How do I learn the fingerstyle guitar technique?",
 "Quora-295521": "Is it weird when I travel and eat in the restaurant alone?",
 "Quora-007203": "How can one find one’s true soulmate?",
 "Quora-073494": "An atheist is diagnosed with cancer and has 1 month of life. What does an atheist do before he dies?",
 "Quora-237717": "Why introverts are introvert?",
 "Quora-181315": "How much can Chris Hemsworth bench press?",
 "Quora-092706": "How do I stay awake all night to study?",
 "Quora-162792": "How do I improve coding and debugging skills?",
 "Quora-229940": "What will you never stop loving?",
 "Quora-024302": "What are some unethical ways to get your boss fired?",
 "Quora-275043": "Why do some people always fill their lives with so much vulgarity?",
 "Quora-260839": "If I was to wear communist insignia in America, what would the reactions be?",
 "Quora-282327": "Which DSLR should I buy?",
 "Quora-201836": "What is one thing most teenagers want to do before they’re 20?",
 "Quora-274774": "Why hasnt China banned Quora?",
 "Quora-265076": "Which foods are the hardest to cook correctly and why?",
 "Quora-076456": "Why were British Infantry able to defeat French columns and yet others could not?",
 "Quora-091156": "Did Neil Armstrong really land on moon?",
 "Quora-158262": "Should I become a diplomat?",
 "Quora-152287": "Is it wrong to be direct about my opinion?",
 "Quora-062914": "USA nuked Japan. Why do they still have sound relation?",
 "Quora-011710": "How often are actual Machine Learning engineers implementing their own algorithms?",
 "Quora-119903": "What is the difference between love making and having sex?",
 "Quora-013952": "How do I debunk God through solid evidence?",
 "Quora-054772": "I&#039;m an adult and my parents won&#039;t let me move out and still control my life, what should I do?",
 "Quora-111987": "Is there a way to categorically prove Harry Potter didn&#039;t happen?",
 "Quora-000005": "How did humans evolve so successfully while other animals lacked in the process of evolving?",
 "Quora-226239": "What is the best martial art which can be used as self defence?",
 "Quora-037639": "Is brown cane sugar healtheir than white sugar?",
 "Quora-192802": "Why is category theory considered controversial among mathematicians?",
 "Quora-281079": "Is it okay for a 15-year-old to read a Harry Potter book?",
 "Quora-174246": "How do I cure my stammering?",
 "Quora-097372": "I smacked a woman because she tried to hug me. Was this justified?",
 "Quora-044290": "Why is the flamethrower no longer used by the US Military?",
 "Quora-177726": "Which motivational book I should follow?",
 "Quora-096833": "What if Hitler didn&#039;t kill himself?",
 "Quora-111276": "Who is the first man on moon?",
 "Quora-011454": "How can you make yourself fat?",
 "Quora-211453": "Is it okay to share your wife?",
 "Quora-025061": "How do I push myself to study in the afternoon?",
 "Quora-205771": "Who is the most age defying athlete?",
 "Quora-184610": "I found out that the guy I had a crush on has been sex-chatting with other women on social media. How do I politely turn him down?",
 "Quora-281345": "In movies, why don&#039;t women risk everything to protect their lover (like men do)?",
 "Quora-207637": "Who would win: Luke Skywalker or Darth Sidious?",
 "Quora-256543": "Do doctors get grossed out by diseases?",
 "Quora-004086": "What is more prestigious, Rhodes Scholar or Harvard graduate?",
 "Quora-276552": "What do top executives do that employees don&#039;t?",
 "Quora-163653": "Why aren&#039;t there more US students in Swiss universities as they are almost free?",
 "Quora-227230": "Is it true that jews can&#039;t ask others to help them do the things they&#039;re not allowed on Shabbat?",
 "Quora-062396": "I downloaded an entire TV series on PC and I watched it 10 times. I love that show. It took 30 days of my life. Am I crazy?",
 "Quora-187490": "Are the people of Arunachal Pradesh willing to join China?",
 "Quora-126234": "How do I for call off an arranged marriage after engagement?",
 "Quora-004905": "If someone called you a loser, how would you respond?",
 "Quora-260010": "Is climate change a hoax?",
 "Quora-258774": "Why would Donald Trump&#039;s order on immigration be considered unconstitutional?",
 "Quora-097552": "I don&#039;t enjoy being a parent, how do I cope?",
 "Quora-223226": "Who are the best strikers in the world?",
 "Quora-232922": "Could the United States end up at war with Europe?",
 "Quora-054744": "Why is Prince Philip not as popular as Queen Elizabeth II?",
 "Quora-190580": "How did &quot;spawn&quot; become the verb for loading a new life in video games?",
 "Quora-143086": "I wanna die. How do I die painlessly?",
 "Quora-188660": "What would have happened to America if the South had won the Civil War?",
 "Quora-013163": "If Jon Snow is a Targaryen, why did his hand get burned? Is it because he is half Targaryen?",
 "Quora-285298": "Why do so many extremely intelligent people become obsessed with anime?",
 "Quora-082160": "What if all our clothes disappeared?",
 "Quora-179380": "Which is the best source to learn Android app development?",
 "Quora-072492": "What is true love or true relationship?",
 "Quora-290100": "Since Trump wants to terminate the Visa Waiver Program, should the 38 countries band together to retaliate in kind against US citizens?",
 "Quora-281830": "What is OCD?",
 "Quora-056412": "My toddler thows herself on the ground, and starts screaming and carrying on. How do you get her to stop doing this?",
 "Quora-238910": "Should a mother disclose the contents of a meal she has prepared?",
 "Quora-017985": "Will you vote for an atheist president or a religious one?",
 "Quora-156604": "Do black people really believe in black Jesus?",
 "Quora-028599": "What are some surprising differences in laws between the US and the United Kingdom?",
 "Quora-146029": "My ex texted me she was home safe and thanked me for having her over. Then said it was nice spending time with you. What do I make of that?",
 "Quora-187020": "Should I become a nurse first then become a doctor?",
 "Quora-180615": "Why are geniuses more likely to be male than female?",
 "Quora-271349": "What&#039;s the difference between baking powder and baking soda?",
 "Quora-149139": "Was Super Bowl LI rigged?",
 "Quora-158196": "Which &quot;Friends&quot; actor&#039;s career has suffered the most post-show?",
 "Quora-151341": "What is the Queen of England&#039;s birth name?",
 "Quora-227760": "How do I see the Facebook visiter of our profile?",
 "Quora-073834": "In high school, are the programmer kids becoming the new &quot;cool&quot; kids?",
 "Quora-186678": "How do I ask my teacher to a movie?",
 "Quora-073295": "Why did the Nazis use gas chambers?",
 "Quora-142824": "Do you draw on the desks at school?",
 "Quora-113642": "Why do Swedes speak English so well?",
 "Quora-173934": "If I point a laser beam to a helicopter or airbus, what happen there?",
 "Quora-232373": "Why does there seem to be a lack of major African inventions?",
 "Quora-081070": "What does it mean when he says he&#039;s considering dating me in the future?",
 "Quora-179761": "What are the difference between Catholics and protestants?",
 "Quora-181396": "Overlooking religious standings, why is it wrong to have sex before marriage?",
 "Quora-088412": "Why is it tough to get work-life balance?",
 "Quora-210148": "Is heat a form of energy?",
 "Quora-294818": "Can we travel as fast as light?",
 "Quora-142995": "What do 30-40 year old married couples fight about?",
 "Quora-287245": "Will it be weird later if I ask a girl out and she says no?",
 "Quora-096698": "Should there be a Star Wars Rogue Two?",
 "Quora-058998": "How do you cope with depression in order to function?",
 "Quora-248944": "Is 21 too early to move in together?",
 "Quora-173127": "Do flights take a trial run before starting a new commercial route?",
 "Quora-148784": "How do prisons deal with mentally ill prisoners?",
 "Quora-227701": "Do Tamilians want a seperate nation?",
 "Quora-080340": "How long could a 20th century ship withstand a 19th century warship attack?",
 "Quora-283813": "My bedroom will have no windows, how do I cope with that?",
 "Quora-059613": "Why do people dislike Quora&#039;s anonymous feature?",
 "Quora-287006": "How can I become more creative?",
 "Quora-254912": "What are some little-known tricks on the Quora app?",
 "Quora-049861": "What were Darth Vader&#039;s hobbies?",
 "Quora-023968": "How do I kill corrupt politicians?",
 "Quora-139368": "Which is better - the Moto G4 Plus or Redmi Note 4?",
 "Quora-217532": "Is there a cancer cure conspiracy?",
 "Quora-215763": "Why do people do not like rap music?",
 "Quora-238488": "How does the rest of the world currently view the U.S.A?",
 "Quora-238444": "Do you believe the saying &quot;Once a cheater, always a cheater.&quot;?",
 "Quora-198626": "Do black people have privilege?",
 "Quora-178361": "What weapon is normally used to shoot down fighter jets?",
 "Quora-048930": "What is an atheist?",
 "Quora-091109": "How can I increase the speed of my laptop?",
 "Quora-249009": "Who was the deadliest medieval swordsman?",
 "Quora-008873": "How and why is it legal for an adulterous wife to get money from the divorce?",
 "Quora-213489": "How does the &quot;girl rating&quot; algorithm in The Social Network work?",
 "Quora-257232": "When do people find time to read a book?",
 "Quora-033365": "How do people earn money from YouTube channel?",
 "Quora-056285": "Why don&#039;t most math teachers give real world uses for what they teach?",
 "Quora-125172": "Why can&#039;t we fire nuclear waste into space?",
 "Quora-086317": "If both China and Taiwan became one country, what would it be called?",
 "Quora-114661": "Why do high school students sleep in class?",
 "Quora-159377": "What do atheists/agnostics wish Christians would stop doing?",
 "Quora-294147": "What are some tips that will help me get through high school?",
 "Quora-124740": "Why are true friend hard to find?",
 "Quora-138407": "What type of work do we get in PSU if we are recruited through GATE?",
 "Quora-052692": "What are my chances of getting into a top university (Stanford, UCLA)? Do you have any tips or suggestions of things I can do?",
 "Quora-184673": "What is game engine?",
 "Quora-171694": "Should I get revenge on my ex?",
 "Quora-083200": "How do you become a mature man?",
 "Quora-251411": "Did the US create ISIS?",
 "Quora-293090": "What exactly is Sensex and Nifty?",
 "Quora-097223": "What are the best JavaScript books?",
 "Quora-115326": "I&#039;m sleeping 12 hours. What&#039;s wrong with me?",
 "Quora-121708": "Why doesn’t India give Kashmir to the Kashmiris?",
 "Quora-108254": "Did snipers in WW2 really wrap their guns in camouflage?",
 "Quora-179188": "Is it advisable to pay tip in cash?",
 "Quora-068187": "What is best paying jobs in India?",
 "Quora-089071": "How did you start playing the piano?",
 "Quora-084136": "Why did the US pick Cuba for Guantanamo Bay prison instead of a country we are allies with?",
 "Quora-060366": "How do I stop envying men who have success with women?",
 "Quora-111029": "How can I convert to Buddhism?",
 "Quora-048927": "Is affirmative action racist",
 "Quora-013502": "What are the signs of a teenager being a genius other than grades?",
 "Quora-156974": "How can one stop feeling people who are more good-looking, wealthier and more powerful have more value than oneself?",
 "Quora-012681": "What is Barron Trump’s actual IQ?",
 "Quora-279140": "Why and how did Google surpass all the other search engines?",
 "Quora-169525": "Can any guy get a girlfriend regardless of his physical looks?",
 "Quora-134277": "Could we obtain energy using gravity?",
 "Quora-114459": "Which do you think is the most biased? Quora, Reddit, or Wikipedia?",
 "Quora-247218": "What&#039;s the right religion?",
 "Quora-267452": "If man evolved from the monkeys, why still we see monkeys?",
 "Quora-178448": "What was socially acceptable in Roman times but would be horrifying today?",
 "Quora-039559": "Is it easy to ride an Enfield?",
 "Quora-052400": "What is the most advanced and difficult branch of mathematics for any mathematician with a PhD?",
 "Quora-265622": "How I can gain weight quickly?",
 "Quora-258647": "What is the proof for goldbach&#039;s conjecture?",
 "Quora-142650": "Do you think churches should be taxed?",
 "Quora-269755": "Where is the most dangerous place you have traveled?",
 "Quora-132023": "Why is Chelsea so strong this season?",
 "Quora-242969": "Who was the most hated US President in American history?",
 "Quora-084693": "Is it true that most people would stop eating meat if they saw what goes inside their slaughterhouse?",
 "Quora-004219": "How should I learn the guitar?",
 "Quora-075976": "What would you call your parent that is non gender specific?",
 "Quora-150464": "Is love at first sight real?",
 "Quora-284598": "What is time actually?",
 "Quora-051863": "What do you do when someone is stalking you on Quora?",
 "Quora-246978": "Is Theresa May the weakest PM the UK has ever had?",
 "Quora-081099": "Why won&#039;t China let Taiwan exist as a separate sovereign nation?",
 "Quora-204877": "What would be the consequences of a Frexit?",
 "Quora-150818": "How can I overcome the pain of rejection?",
 "Quora-222140": "What will become of the character of Princess Leia after Star Wars: The Last Jedi?",
 "Quora-251010": "Is the caste reservation system in India good or bad?",
 "Quora-250854": "I&#039;m 5&quot;5 and a lot of girls are attracted to me, but why?",
 "Quora-047328": "Can you build muscle with light weights?",
 "Quora-231794": "How do I get over my gynophobia? It&#039;s ruining my life?",
 "Quora-287338": "What are your views about the decision of America to prohibit the entry of 7 Muslim countries?",
 "Quora-050486": "Are Americans or people living in the West really that obsessed with sex and dating as they show in sitcoms, dramas and movies?",
 "Quora-248979": "How long can fingerprints last on a gun or ammunition?",
 "Quora-254019": "Why were little girls dresses in the 50&#039;s so short?",
 "Quora-089106": "How do I identify the name of the man in the picture?",
 "Quora-293378": "Can I learn multiple languages in the same time?",
 "Quora-057023": "Should my dad have told me about his new girlfriend before inviting her over?",
 "Quora-103002": "Why are average Malayalees more fairer than other average south Indians?"
}
