{
 "Quora-098413": {
  "sentences": [
   "He probably doesn’t even have insomnia at all.",
   "When you’re with him, all the distractions leave, and he has a peaceful sleep.",
   "But when somebody is with us, we cherish those moments and sleep along with them."
  ],
  "full_text": "It obviously has emotional reasons. He probably doesn’t even have insomnia at all. Insomnia is when, whatever you do, you’re unable to sleep. But also loneliness, stress, and sadness make you lose sleep pretty easy. When you’re with him, all the distractions leave, and he has a peaceful sleep. A presence in the bed makes you forget about the stressful situations at work or about worries ans duties. When you see someone loved sleeping next to you, you realize that those problems are not worth worrying about. Yes, it can be explained scientifically but it doesn’t have to. It’s just that, when we feel lonely in bed, we lose desire to have a peaceful, healthy sleep. But when somebody is with us, we cherish those moments and sleep along with them. Simple.",
  "short_answers": [
   "When you’re with him, all the distractions leave",
   "He probably doesn’t even have insomnia"
  ]
 },
 "Quora-127084": {
  "sentences": [
   "Yes, different people did so.",
   "I responded no, not interested.",
   "In some extreme cases I said no and explained that if there would any repeated try, I would consider it as aggressive assault and act appropriately."
  ],
  "full_text": "Yes, different people did so. I responded no, not interested. In some extreme cases I said no and explained that if there would any repeated try, I would consider it as aggressive assault and act appropriately. What can I conclude about the situation? Some men believe that they are so irresistible that women literally would fall to their feet as soon as they hear the offer. Reality is different. Sometimes such kind of attention is plain insulting, sometimes (very seldom) it’s flattering. Usually I would just take a mental note and brush it off. My attitude: life is way too short to waste it on negativity.",
  "short_answers": [
   "Yes",
   "not interested",
   "I said no and explained that if there would any repeated try, I would consider it as aggressive assault and act appropriately"
  ]
 },
 "Quora-093211": {
  "sentences": [
   "EARLY in the day.",
   "Because the early hours of the day are the optimal time for your analytical brain to perform the most complex tasks (in the case of studying, these can be reading, comprehension, application, repetition)."
  ],
  "full_text": "EARLY in the day. Why?. Because the early hours of the day are the optimal time for your analytical brain to perform the most complex tasks (in the case of studying, these can be reading, comprehension, application, repetition). Some scientists call this time of day the brain’s peak performance time, and it's roughly 2-4 hours after we wake up. So, for example, if you wake up at 6, your peak times for learning are between 8 and 10 a.m. You can extend this time until midday so that you cover the most important concepts by lunchtime.",
  "short_answers": [
   "the early hours of the day",
   "2-4 hours after we wake up"
  ]
 },
 "Quora-071611": {
  "sentences": [
   "In part because there are a lot more religions than the one you're quoting from."
  ],
  "full_text": "In part because there are a lot more religions than the one you're quoting from. The Hopi people believe that the human race ascended from a primordial state as animals through a series of underworlds, led by the Spider Grandmother. The ancient Greeks believed that people were made by the gods out of a mixture of clay and fire. The Jews believe that people were made out of dust. You can't all be right, can you?",
  "short_answers": [
   "there are a lot more religions than the one you're quoting from"
  ]
 },
 "Quora-250315": {
  "sentences": [
   "Used cars can definitely be a smart way to save money and/or change cars frequently without wasting too much money."
  ],
  "full_text": "Used cars aren’t just for people who don’t have money to buy brand new ones. You can get a used car with 20,000 miles which is $10,000 cheaper. You can get an old car at $3000 and keep it for 3–4 years and then resell it for $1500. The more expensive the car is, the more money it will lose over time. I’ve seen a great car (Honda Civic) at 8500 euros in Germany and it had 46,000 km. It was as new at half the price (from 2009). Used cars can definitely be a smart way to save money and/or change cars frequently without wasting too much money.",
  "short_answers": [
   "a smart way to save money",
   "change cars frequently without wasting too much money"
  ]
 },
 "Quora-233799": {
  "sentences": [
   "Sociopaths are made, not born.",
   "They have circumstances in their lives, whatever they may be, that change their interaction in the world."
  ],
  "full_text": "Sociopaths are made, not born. They are not the same thing as a psychopath though some people are dedicated in making them synonymous. They have circumstances in their lives, whatever they may be, that change their interaction in the world. When children are born, circumstances affecting brain function change what neurons grow. If you are spoken to and read to, neurons attributable to language are nourished, if not, they will die. It can be sometimes changed or reversed if heavy intervention is applied in later life. If you raise a child with pain, abuse, and neglect you can create yourself a fun sociopath. (Note sarcasm on the fun part).",
  "short_answers": [
   "Sociopaths are made"
  ]
 },
 "Quora-231662": {
  "sentences": [
   "Answer is because they don’t.",
   "Indians are not killing their own Kashmiri people."
  ],
  "full_text": "Answer is because they don’t. Indians are not killing their own Kashmiri people. From wherever you are getting this information is mostly incorrect. I agree, There have been incidents where defense is using its power to stop violent crowd. But it is all because of Pakistan is instigating young people there, against Indian government and supplying arms and other misleading propaganda whereas they should get supply of good education and jobs. Trust me, I have talked with lot of Kashmiri Muslims and they all want peace there. Lot have moved to towards Delhi and southern part of India and doing good in business. I had met one family in Goa recently. They are selling nice artistic blankets and statues and they are quite happy with it. They always wish that they can go back there and do same thing there as well. They see current Indian government in a very positive way and think that someday there would be peace in the valley and people will get jobs there as well.",
  "short_answers": [
   "they don’t",
   "Indians are not killing their own Kashmiri people"
  ]
 },
 "Quora-281590": {
  "sentences": [
   "Breathe control.",
   "Maintaining your breathing is crucial to keeping your wits about you."
  ],
  "full_text": "Breathe control. Maintaining your breathing is crucial to keeping your wits about you. If you scream yourself into a tizzy without adequate oxygen flow to the brain you risk passing and that has got to be the biggest no no in my opinion. Regardless of how you choose to endure the situation it is vital to always be as aware as possible of your suroundings.",
  "short_answers": [
   "Breathe control"
  ]
 },
 "Quora-280658": {
  "sentences": [
   "To prevent dictatorial excesses like the Cultural Revolution.",
   "To prevent a CR-like reoccurrence, the cult of personality was almost completely abolished, power was distributed throughout the politburo instead of being concentrated in one man’s hands, and term limits were set."
  ],
  "full_text": "To prevent dictatorial excesses like the Cultural Revolution. After the Dengist bloodless coup took power from the Maoists in the ‘70s, a lot of people who had gotten screwed over hard in the Cultural Revolution came to power. The CR was partly a ploy for Mao to keep power for life. To prevent a CR-like reoccurrence, the cult of personality was almost completely abolished, power was distributed throughout the politburo instead of being concentrated in one man’s hands, and term limits were set.",
  "short_answers": [
   "To prevent dictatorial excesses",
   "To prevent a CR-like reoccurrence"
  ]
 },
 "Quora-288160": {
  "sentences": [
   "According to the Global peace Index 2017, Iceland is the most chilled country."
  ],
  "full_text": "According to the Global peace Index 2017, Iceland is the most chilled country. No pun intended. The index, developed by the Institute of Economics and Peace, is a ranking of 162 countries based on 22 different indicators including level of violent crime, relations with neighbouring countries, the absence of war, contribution to U. N peace keeping mission, schooling…etc.. The lower the GPI index score , the more peaceful the country is.",
  "short_answers": [
   "Iceland"
  ]
 },
 "Quora-085955": {
  "sentences": [
   "One of the easiest things you can do to learn English faster is to read as much as you can.",
   "Read things all the time."
  ],
  "full_text": "Read, read, read. One of the easiest things you can do to learn English faster is to read as much as you can. Read things all the time. This will make your vocabulary better and it will also help you learn grammar and slang. Read comics. An easy option, if you don't want to read children's books, is to read comic books or comics instead. You can buy many English language comic books in bookstores and online, or you can read free comics online (these are usually called webcomics).Read books you've read before. You can also read a book you have read before. If you already know a little bit about what happens, then you will have an easier time guessing and understanding the words. Read the newspaper. Newspapers are a good way to learn the basics of a language, because they usually have very good grammar and are written to be easy to understand. You can find online versions of many good English language newspapers, like the New York Times or The Guardian.",
  "short_answers": [
   "read as much as you can",
   "Read things all the time"
  ]
 },
 "Quora-061358": {
  "sentences": [
   "There are no more barbarian hordes who want to destroy the places of higher learning, churches and so forth.",
   "Truly severe global warming leading to the starvation of billions could do it.",
   "Another possibility is a wave of religious imbecility that wipes out liberal democracy all over the world and replaces it with some kind of authoritarian theocracy."
  ],
  "full_text": "There are no more barbarian hordes who want to destroy the places of higher learning, churches and so forth. If our civilization falls it will be because we did something profoundly stupid ourselves. Truly severe global warming leading to the starvation of billions could do it. Another possibility is a wave of religious imbecility that wipes out liberal democracy all over the world and replaces it with some kind of authoritarian theocracy. But frankly, I don’t see that last one ever happening. An environmental catastrophe is more likely. Say 200–300 years?",
  "short_answers": [
   "to destroy the places of higher learning, churches and so forth",
   "severe global warming",
   "a wave of religious imbecility"
  ]
 },
 "Quora-286821": {
  "sentences": [
   "You Should Only Use the Charger That Came With Your Device."
  ],
  "full_text": "You Should Only Use the Charger That Came With Your Device. Modern smartphones use USB chargers, which are standardized. As long as a USB charger can provide enough power, you can use it to charge your smartphone or any other device that supports USB charging. Feel free to plug your phone into a more powerful charger. Your phone will only draw as much power as it needs from the charger, so it shouldn’t become damaged. In fact, your phone may even charge faster with a more powerful charger. You could plug your phone into a less-powerful charger, too — it just wouldn’t charge as fast, or it may not charge at all if the charger isn’t powerful enough",
  "short_answers": [
   "Only Use the Charger That Came With Your Device"
  ]
 },
 "Quora-072135": {
  "sentences": [
   "They came into the world together, and seemed to have been nearly identical at an early age.",
   "The rest of the Realm isn’t good enough for them, except the Targaryens, and, frankly, they are both better looking than most people.",
   "It is narcissism on both parts from the get go."
  ],
  "full_text": "They came into the world together, and seemed to have been nearly identical at an early age. They were both spoonfed a steady diet of the fawning awe given to most high houses of the Seven Kingdoms, combined with a unending message of superiority from their father. Who else are they going to fall in love with? The rest of the Realm isn’t good enough for them, except the Targaryens, and, frankly, they are both better looking than most people. Jaime And Cersei both know what it’s like to grow up as beautiful Lannisters at the same time. No one else in the world relates on that level. The Lannisters tend towards narcissism, especially the non-dwarven, non-misshapen ones. Most of all they see themselves in each other. It is narcissism on both parts from the get go. Humping Cersei is like humping a version of himself.",
  "short_answers": [
   "narcissism on both parts",
   "have been nearly identical at an early age"
  ]
 },
 "Quora-135181": {
  "sentences": [
   "I don't shop at Whole Foods because it's too expensive.",
   "My food tastes don't really align with their strengths, either."
  ],
  "full_text": "I don't shop at Whole Foods because it's too expensive. My food tastes don't really align with their strengths, either. I try to eat lots of fruits and veggies, but prefer to get stuff from normal grocery stores when it's on sale (i.e. in season). I'm fine with Costco meat bought in bulk and frozen until I need it. I'm sure you can taste the difference, but I can't. It's all going to get cooked on Sunday for the week ahead anyway. I also like sugar and grease and packaged foods, even though I know I probably shouldn't.",
  "short_answers": [
   "it's too expensive",
   "My food tastes don't really align with their strengths"
  ]
 },
 "Quora-185541": {
  "sentences": [
   "He got rid of anybody whom he even thought might be opposed to his views, and he bribed the remainder with large payments, along with an implied threat that something bad would happen to them or their families if they tried to quit.",
   "He also surrounded himself with fanatically loyal bodyguards."
  ],
  "full_text": "He got rid of anybody whom he even thought might be opposed to his views, and he bribed the remainder with large payments, along with an implied threat that something bad would happen to them or their families if they tried to quit. He also surrounded himself with fanatically loyal bodyguards. Shooting Hitler by yourself guaranteed that you would die in a hail of bullets five seconds later. Dictators first wipe out the opposition, then use a combination of the carrot and the stick to retain the loyalty of the remainder. They give their retainers a lavish lifestyle. Anybody who doesn’t toe the line is executed. After a few years of this, there’s nobody with any integrity left. Stalin and Saddam Hussein did exactly the same thing.",
  "short_answers": [
   "got rid of anybody whom he even thought might be opposed to his views",
   "bribed the remainder with large payments",
   "surrounded himself with fanatically loyal bodyguards"
  ]
 },
 "Quora-232833": {
  "sentences": [
   "No, staying in USA without authorization is not a felony (in layman’s term: crime).",
   "It is obviously a violation of the law —just like driving above the speed limit— but it’s a misdemeanor at worst."
  ],
  "full_text": "No, staying in USA without authorization is not a felony (in layman’s term: crime). It is obviously a violation of the law —just like driving above the speed limit— but it’s a misdemeanor at worst. It only becomes a felony if you reenter after the court has you removed (deported).Defendants in purely immigration cases are not entitled to counsel (a lawyer) at government’s expense, because immigration is a civil matter. Otherwise the 6th amendment of the constitution would apply, because it guarantees the right to counsel for criminal proceedings.",
  "short_answers": [
   "No",
   "staying in USA without authorization is not a felony",
   "it’s a misdemeanor"
  ]
 },
 "Quora-249774": {
  "sentences": [
   "My answer is: because Prisoner of Azkaban was the first book when the series showed its potential.",
   "Prisoner of Azkaban was the first book in the series that really impressed me.",
   "The third book was the one that changed my mind."
  ],
  "full_text": "My answer is: because Prisoner of Azkaban was the first book when the series showed its potential. The first two books were simple as compared with the five to follow. First we have Hagrid rescue Harry from the Muggle world and get to know about Hogwarts and some of the major characters. The second book was a sequel to the above. But by the third book, Rowling showed that she had learned from Dame Agatha Christie. The mystery of Sirius Black was the cleverest part of the series to date. As you know, Rowling continued in that direction, culminating in the two mysteries in the last book: where are those Horcruxes? And, what is the truth behind the Deathly Hallows?. Prisoner of Azkaban was the first book in the series that really impressed me. I’d only read the first two because my kid brother pestered me. I’d thought they were nice and well-written, but nothing extraordinary. The third book was the one that changed my mind. That is certainly why I like Prisoner of Azkaban.",
  "short_answers": [
   "Prisoner of Azkaban was the first book when the series showed its potential",
   "really impressed me",
   "changed my mind"
  ]
 },
 "Quora-254817": {
  "sentences": [
   "Tourette Syndrome is very exhausting as your body is always moving and you are always making noises and saying things.",
   "There is not much to say about Coprolalia except that it is hard to go out with it because sometime parents will say to you get way from my child as they don’t want there child to hear bad stuff."
  ],
  "full_text": "I have Tourette’s with Coprolalia. I can’t hold my tics in and don’t know they are coming. Tourette Syndrome is very exhausting as your body is always moving and you are always making noises and saying things. One thing I here often is “Do you tic in your sleep?” Yes I do, so you don’t sleep very well and wake others up in the house. I have hurt myself from my tics where I have dislocated parts of my body, broken my bones, hurt discs in my neck, gave myself corneal abrasions from scratching my eye, broken teeth, and a lot more. At times it is hard to walk and do simple tasks with tics. Medication does help a little bit. There is not much to say about Coprolalia except that it is hard to go out with it because sometime parents will say to you get way from my child as they don’t want there child to hear bad stuff. I don’t just say bad words but for example around when the election for president I would have said “Who did you vote for?” This is also known as Coprolalia as this is not socially appropriate.  I try to spread as much awareness as possible. If you have any other questions I would love to try to answer them.",
  "short_answers": [
   "very exhausting",
   "hard to go out with it"
  ]
 },
 "Quora-240803": {
  "sentences": [
   "I hate it when people are late.",
   "If you are late it tells me that you think my time is not as valuable as yours."
  ],
  "full_text": "Lateness. I hate it when people are late. If you are late it tells me that you think my time is not as valuable as yours. It shows a fundamental lack of respect. Sure, everyone might have a problem now and again. But if you are consistently late you do not respect other people. Period. People who are constantly late always have all sorts of excuses. The answer is simple. Leave earlier.",
  "short_answers": [
   "Lateness",
   "when people are late"
  ]
 },
 "Quora-126498": {
  "sentences": [
   "One methodology for supressing vapour trails is to fly at very high altitudes where humidity is as low as possible, another is to fly lower in much warmer air."
  ],
  "full_text": "One methodology for supressing vapour trails is to fly at very high altitudes where humidity is as low as possible, another is to fly lower in much warmer air.  both work, but whether or not they meet mission requirements is a different situation. Sometimes it just isn’t an issue & at other times it is very relevant.",
  "short_answers": [
   "fly at very high altitudes",
   "fly lower in much warmer air"
  ]
 },
 "Quora-136052": {
  "sentences": [
   "The ratio of the mass of any man made object to that of the Earth is so tiny that the effect is negligible.",
   "The mass which has permanently left the Earth probably amounts to a hundred tons or so - two or three day’s worth of meteorite arrivals."
  ],
  "full_text": "The ratio of the mass of any man made object to that of the Earth is so tiny that the effect is negligible. It is like asking if you would be knocked over if a gnat bumped into you - but much more extreme. Te mass gain from infalling space dust is far greater than that lost from rocket launches - many tons per day. Most of the mass of the rocket launch falls back to the Earth within minutes. Most satellites fall back within years. The mass which has permanently left the Earth probably amounts to a hundred tons or so - two or three day’s worth of meteorite arrivals.",
  "short_answers": [
   "the effect is negligible"
  ]
 },
 "Quora-072760": {
  "sentences": [
   "It would not be a good idea.",
   "A salaried employee is not paid by the hour."
  ],
  "full_text": "It would not be a good idea. A salaried employee is not paid by the hour. I have worked 20 hours in a day and I have worked 0 hours in a day. I got paid the same for both. It didn’t matter if I worked 7 days a week at times, I got paid the same. I was only required to put in the time to accomplish my tasks. At one company I had to fill out a time card and I would put ‘R’ down for everyday of the week. I used ‘R’ for regular. To help out the accounting people I would put ‘V’ for vacation when I took vacation days and ‘H’ for holidays. I would agree to it if I got overtime pay, but I was always classified as exempt, meaning exempt from overtime pay.",
  "short_answers": [
   "It would not",
   "A salaried employee is not paid by the hour"
  ]
 },
 "Quora-282971": {
  "sentences": [
   "Something that you said and didn't realize or they interpreted wrong.",
   "Also your tone of voice.",
   "Some people just have something about them that makes them seem rigid."
  ],
  "full_text": "It could be any number of things. Something that you said and didn't realize or they interpreted wrong. Also your tone of voice. Some people just have something about them that makes them seem rigid. You can come right out and ask iif that's what they think and explain to them that you do not hate them.",
  "short_answers": [
   "Something that you said and didn't realize",
   "tone of voice",
   "seem rigid"
  ]
 },
 "Quora-095704": {
  "sentences": [
   "Yes surely he/she can write novels.",
   "You should have been well versed with vocabulary and must have good reading habits."
  ],
  "full_text": "Yes surely he/she can write novels. All this depends on one's capabilities. Not everyone has perfect command on literature, but, practice can make it better. You should have been well versed with vocabulary and must have good reading habits.",
  "short_answers": [
   "Yes",
   "must have good reading habits",
   "versed with vocabulary"
  ]
 },
 "Quora-018454": {
  "sentences": [
   "As far as I know,a daily running of 15–20 mins in the morning,a healthy breakfast like sprouts,egg without yolks,oats.",
   "Light lunch.",
   "Pushups,chinups,burpees,squats,planks-these exercises dont require you to go to gym."
  ],
  "full_text": "As far as I know,a daily running of 15–20 mins in the morning,a healthy breakfast like sprouts,egg without yolks,oats. Light lunch. Any sports in the evening-football ,volleyball etc. Pushups,chinups,burpees,squats,planks-these exercises dont require you to go to gym. In one month,you can feel the difference. The more u sweat, the more u shine.",
  "short_answers": [
   "a daily running",
   "Light lunch",
   "Pushups,chinups,burpees,squats,planks"
  ]
 },
 "Quora-022206": {
  "sentences": [
   "To ensure the offender never has the ability to leave prison, even as a parolee."
  ],
  "full_text": "To ensure the offender never has the ability to leave prison, even as a parolee. In Canada, a 400 year sentence would never be seen, as we have certain sentencing principles under our Criminal Code which dictate that the sentence must be proportionate to the gravity of the offence and must also not be unduly harsh giving consideration to both the mitigating and aggravating factors involved.",
  "short_answers": [
   "the offender never has the ability to leave prison"
  ]
 },
 "Quora-050596": {
  "sentences": [
   "Yes.",
   "A lot of times actually.",
   "I am not able to recall any particular incident but I am sure I have been there."
  ],
  "full_text": "Yes. A lot of times actually. I am not able to recall any particular incident but I am sure I have been there. Sometimes I just sense a feeling of reoccurrence. Feeling that I have already seen the whole scenario that is surrounding me. Basically it's an illusion of having already experienced something which in actual fact is being experienced for the first time. This might be the reason of me strongly believing in 'Maktub'.But whatever it is, it feels weird.",
  "short_answers": [
   "Yes",
   "A lot of times",
   "I have been there"
  ]
 },
 "Quora-171125": {
  "sentences": [
   "Just don’t.",
   "So if you are interested in your child’s health and development, understand the effects of your behavior and don’t do that again!"
  ],
  "full_text": "I will really give a very short answer to that topic because this ignorance makes me just angry. Just don’t. After reading this answer I expect you to open a tab and start googling about the effect of forcing a child to use his right hand instead of his/her dominant left hand. What you are doing is reprogramming the child’s brain with often very negative results on the development of the child. So if you are interested in your child’s health and development, understand the effects of your behavior and don’t do that again!",
  "short_answers": [
   "don’t do that again",
   "Just don’t"
  ]
 },
 "Quora-203291": {
  "sentences": [
   "There are many methods that require proper work and knowledge and voila you can money online with a website, but before you earn you have to learn."
  ],
  "full_text": "Creating a website is very simple friend, the hard part is making the decision about what your website will be about and how to market with it in order to generate a good revenue. There are many methods that require proper work and knowledge and voila you can money online with a website, but before you earn you have to learn. So if you are interested then you have to prove that you really want to work online and maintain that income with hard work. You can view my blog it will teach you from starting a website to choosing your promotion technique, hope it helps. Online Jobs.",
  "short_answers": [
   "require proper work and knowledge"
  ]
 },
 "Quora-254910": {
  "sentences": [
   "I, personally, wouldn't trust the doctors taking care of me if they figured out I was an organ donor."
  ],
  "full_text": "I, personally, wouldn't trust the doctors taking care of me if they figured out I was an organ donor. Once they find that out, they probably wouldn't work as hard to save me. They'll probably want me to die so that they could use my organs. However, I'm sure this isn't true at all. I'm sure doctor bend over backwards trying to save their patients’ lives. Maybe I'm just paranoid after watching greys anatomy so much.",
  "short_answers": [
   "I, personally, wouldn't trust the doctors"
  ]
 },
 "Quora-051909": {
  "sentences": [
   "Just go for Redmi Note 3 without any second thought .",
   "Its a very powerfull device and at the same time power efficient too.",
   "Awesome battery life , decent camera pair under normal lighting conditions."
  ],
  "full_text": "Just go for Redmi Note 3 without any second thought . Its a very powerfull device and at the same time power efficient too. Awesome battery life , decent camera pair under normal lighting conditions. Got Marshmallow update also .Note 4 has a better display (2.5D) , better in-hand feel,slightly better camera but as you mentioned its hard to get , so u can go with Note 3. I am. using Note 3 3gb variant since last 8–9 months and i have not faced even a single issue with the device. So without any doubt , i ll recommend you to purchase this device. Have a look at these pics from Redmi note 3.",
  "short_answers": [
   "Just go for Redmi Note 3",
   "very powerfull device and at the same time power efficient",
   "Awesome battery life , decent camera"
  ]
 },
 "Quora-195686": {
  "sentences": [
   "All things being equal Trump’s chances of being impeached are 4.5% so pretty low."
  ],
  "full_text": "Of the last 44 presidents of the United States only two have been impeached. All things being equal Trump’s chances of being impeached are 4.5% so pretty low. The future might reveal that all things are not equal but since it’s day 1 of 1,460 days in office I think it’s too early to get a better estimate than that. If Donald Trump is impeached by the house of representatives and found guilty by the Senate, Mike Pence will become the 46th president of the United States.",
  "short_answers": [
   "4.5%"
  ]
 },
 "Quora-084051": {
  "sentences": [
   "This has been clearly laid out by DropBox executives in the past, and the primary reason was very clear: Cost control.",
   "There were other secondary reasons too, like looming AWS Managed Services, flexibility, Infrastructure control etc."
  ],
  "full_text": "This has been clearly laid out by DropBox executives in the past, and the primary reason was very clear: Cost control. There were other secondary reasons too, like looming AWS Managed Services, flexibility, Infrastructure control etc. The costing model DropBox was subjected to with AWS, was very expensive in the longer run, compared to them hosting their own. This was piloted and determined from an extensive activity done in the backend by DropBox. This is not surprising, because most of the companies in recent past, who have moved out from AWS to a private cloud model, have had more or less the same reasons.",
  "short_answers": [
   "Cost control",
   "looming AWS Managed Services, flexibility, Infrastructure control"
  ]
 },
 "Quora-163796": {
  "sentences": [
   "I personally believe that it's not a big deal whether she is virgin or not?",
   "So, it's almost a compulsion to marry a non-virgin girl."
  ],
  "full_text": "I personally believe that it's not a big deal whether she is virgin or not? At the end of the day the only thing that matter is whether she loves you or not. She might have boyfriend whom she loved. So, it's a natural thing to have sex when you are in a relationship. By the way, at present time it is almost impossible to get a virgin girl. So, it's almost a compulsion to marry a non-virgin girl.",
  "short_answers": [
   "it's not a big deal whether she is virgin or not",
   "it's almost a compulsion to marry a non-virgin girl"
  ]
 },
 "Quora-070658": {
  "sentences": [
   "Having something stolen from you.",
   "But the feeling of loosing an expensive item does put a hole in the heart."
  ],
  "full_text": "Having something stolen from you. Though this is not the worst thing that can happen,but the feeling is terrible. You feel like a total loser. You feel you could have been more careful and taken some necessary precautions to prevent it from happening. But the feeling of loosing an expensive item does put a hole in the heart.",
  "short_answers": [
   "feeling of loosing an expensive item",
   "Having something stolen"
  ]
 },
 "Quora-200963": {
  "sentences": [
   "So western allies tried to pacify Germany and Japan with other means, turning them into economical powerhouses."
  ],
  "full_text": "One additional reason is that WWI and it’s aftermath made it clear that punishing your enemy after war may not be so good idea. Beast will rise again, even more fierce and dangerous. So western allies tried to pacify Germany and Japan with other means, turning them into economical powerhouses. USSR turned his part into vassal states under his strict control and they turned against him as soon as they saw a possibility.",
  "short_answers": [
   "western allies tried to pacify Germany and Japan with other means"
  ]
 },
 "Quora-264537": {
  "sentences": [
   "However, if she decided to do it no will object.",
   "She is a guest and, a queen and diplomatically immune."
  ],
  "full_text": "I don’t think a queen such as Queen Elizabeth will do such thing. However, if she decided to do it no will object. She is a guest and, a queen and diplomatically immune. The women driving in my country is not a matter of the state. The royal family are open minded. I think the people will object this. I hope in the near future that women are able to drive. Once approved :) I will buy a car for my wife.",
  "short_answers": [
   "it no will object",
   "a queen and diplomatically immune"
  ]
 },
 "Quora-190840": {
  "sentences": [
   "The only way to change someone’s mind is to give them what they think they want and make them think you are on their side.",
   "You have to clean up your own messes with them."
  ],
  "full_text": "The only way to change someone’s mind is to give them what they think they want and make them think you are on their side. If you want to do it to your advantage, then find common ground and suggest an irresistible idea that benefits you and them and deliver in a way that they can’t resist. How do you find that?. You have to clean up your own messes with them. Then you have to listen to what they want. Discover their perspective and then invent a strategy they love that benefits what you want.",
  "short_answers": [
   "give them what they think they want",
   "make them think you are on their side",
   "clean up your own messes"
  ]
 },
 "Quora-271812": {
  "sentences": [
   "Being a vast land mass Russia spans both Asia and Europe and what is called Eurasia."
  ],
  "full_text": "Being a vast land mass Russia spans both Asia and Europe and what is called Eurasia. The capital Moscow lies technically in Europe which makes it a European country while it shares borders with China also. One has to understand that continents are not official divisions but a near accurate division of the earth's land mass. We never use the continent while writing down the address. What's more official is association of countries like the emu and EU. When we hear about turkey joining Europe its actually turkey joining the European union and/or EU if at all. Hope I've been able to clear some air.",
  "short_answers": [
   "Eurasia"
  ]
 },
 "Quora-203841": {
  "sentences": [
   "The best doctor for liver cancer in Mumbai is probably me.",
   "And I can be easily contacted in the hospital."
  ],
  "full_text": "I hate to say this and I know it sounds arrogant but it also sounds like you’re in trouble. The best doctor for liver cancer in Mumbai is probably me. And I can be easily contacted in the hospital. I thought about not answering since this sounds like I’m advertising. I thought about messaging you. Finally I decided I don’t care what anyone thinks. This is probably an objective and factual answer. My apologies to all the other doctors in Mumbai who treat liver cancer. Perhaps, like Donald Trump, I’m also developing delusions of grandeur.",
  "short_answers": [
   "me",
   "I"
  ]
 },
 "Quora-268012": {
  "sentences": [
   "I honestly don’t think confronting in any sense is a good idea.",
   "Considering the social backlash if he comes out, for whatever reason, it is his choice, and coming out, or not, is his."
  ],
  "full_text": "I honestly don’t think confronting in any sense is a good idea. His sexuality is his, and he will date and like whoever he likes. If he asks for your advice, please give it, but apart from that, I think leaving him in the closet is a good idea. He obviously has his own reasons why he is in the closet, and the best thing you can do as a brother at the moment, is to leave him be. Considering the social backlash if he comes out, for whatever reason, it is his choice, and coming out, or not, is his.",
  "short_answers": [
   "don’t think confronting in any sense is a good idea",
   "if he comes out, for whatever reason, it is his choice"
  ]
 },
 "Quora-289404": {
  "sentences": [
   "It is for me, but not in the way you probably wish for."
  ],
  "full_text": "It is for me, but not in the way you probably wish for. Thanks for the intention but I iron my own clothes. How did he have his laundry ironed during his bachelor years? If he’s never used an iron and always picked up neatly pressed clothes from a laundromat, he probably wouldn't give your action much thought but would take it for granted. It’s not wifely duty.",
  "short_answers": [
   "It is"
  ]
 },
 "Quora-033432": {
  "sentences": [
   "No, Wikileaks is not derived from Wikipedia."
  ],
  "full_text": "No, Wikileaks is not derived from Wikipedia. Wikileaks derives its information from leaks of previously unpublished secret information. Wikipedia is an encyclopaedia, a tertiary source derived from secondary and sometimes primary sources but published, not secret sources. Wikileaks’ information is not going to be derived from Wikipedia, though it is possible that some of Wikipedia’s content is derived from Wikileaks, either directly or indirectly via press reports.",
  "short_answers": [
   "No"
  ]
 },
 "Quora-255490": {
  "sentences": [
   "Yes, Chamberlain was duped by Hitler, because he believed Hitler’s signature on an agreement meant something.",
   "Hitler gave his word, and Chamberlain accepted it as a matter of course."
  ],
  "full_text": "Yes, Chamberlain was duped by Hitler, because he believed Hitler’s signature on an agreement meant something. Chamberlain was gentleman first, politician second. Hitler gave his word, and Chamberlain accepted it as a matter of course. The situation was rather like Putin guaranteeing Ukraine’s borders, and grabbing the Crimea and stirring up an insurgency in the east. Just goes to show that you should not treat people like Putin and Hitler as trustworthy.",
  "short_answers": [
   "because he believed Hitler’s signature on an agreement meant something",
   "Hitler gave his word, and Chamberlain accepted it"
  ]
 },
 "Quora-160957": {
  "sentences": [
   "It’s perfectly legal.",
   "There are laws about carrying knives (and other bladed potential weapons) in public without due cause, but you can make whatever bladed items you like on private property."
  ],
  "full_text": "It’s perfectly legal. There are laws about carrying knives (and other bladed potential weapons) in public without due cause, but you can make whatever bladed items you like on private property. nb. anybody making such weapons for purpose of criminal acts is a different matter. Then intent has to be shown.",
  "short_answers": [
   "It’s perfectly legal",
   "you can make whatever bladed items you like on private property"
  ]
 },
 "Quora-233722": {
  "sentences": [
   "It is not possible to fly a plane in space.",
   "In space, there is no air so none of these work."
  ],
  "full_text": "It is not possible to fly a plane in space. Air moving over the wings is what give it lift and allows it to manoeuvre. Air is also required by all jet and propeller propulsion systems. In space, there is no air so none of these work. Instead, space travel relies on rockets. A rocket carries its own air or oxygen supply so can operate outside the earth's atmosphere. Of course, it is possible to use rockets to put a plane into space then use the wings to safely land after re-entering the atmosphere. Such operations were rather routine until just a few years ago.",
  "short_answers": [
   "not possible to fly a plane in space"
  ]
 },
 "Quora-170678": {
  "sentences": [
   "I doubt that modern GPS satellites have such a “switch” built into them, as the doubts of the engineers have already been settled."
  ],
  "full_text": "When GPS was first being developed, some of the engineers were skeptical of the relativistic corrections, and so they did indeed include a mechanism by which the correction could be turned on and off from the ground even after the satellites were in orbit. They saw that turning the correction “off” led to errors in the system, and so they left it “on” after that. I doubt that modern GPS satellites have such a “switch” built into them, as the doubts of the engineers have already been settled.",
  "short_answers": [
   "I doubt that"
  ]
 },
 "Quora-079759": {
  "sentences": [
   "I don’t see any protest coming from Indonesia government.",
   "It’s a well known facts that Singapore has a strong relationship with Israel.",
   "And it’s an undeniable facts that Indonesia has a strong business to business and military relationship with Israel."
  ],
  "full_text": "I don’t see any protest coming from Indonesia government. It’s a well known facts that Singapore has a strong relationship with Israel. And it’s an undeniable facts that Indonesia has a strong business to business and military relationship with Israel. The fleet of A4 and F5 jet fighters currently serving in Indonesian Air Force was purchased from IDF back in the 80s. It is the actual jet fighters being used by IDF to shoot down Egyptians and Syrians MIGs during the 1973 Arab-Israeli war. And as of today the Indonesian military purchased many military equipment from Israeli manufacturer.",
  "short_answers": [
   "I don’t see any protest coming from Indonesia government",
   "ingapore has a strong relationship with Israel",
   "Indonesia has a strong business to business and military relationship with Israel"
  ]
 },
 "Quora-232981": {
  "sentences": [
   "If the work is done and if he would be able to be alive after a while, why not.",
   "I do not recommend such a work regime after 30 years old, BTW."
  ],
  "full_text": "If the work is done and if he would be able to be alive after a while, why not. I spent one semester as; Work and study (as a teaching assistant and student at the same time) one full day, one day of sleep, again work and study one full day, then rest and play for four days (mostly in the school, but not in the classroom and rarely in the office), during my time in university. So it can be done, it is efficient (second in my class, school president’s list etc.), but it is tiring, after a while. I do not recommend such a work regime after 30 years old, BTW.",
  "short_answers": [
   "why not",
   "I do not recommend"
  ]
 },
 "Quora-214456": {
  "sentences": [
   "Actually, the fastest way to improve your fingerstyle-picking is practicing your favorite professional fingerpickers' songs and imitating their skills."
  ],
  "full_text": "I've been playing fingerpicking for almost 8 years. Actually, the fastest way to improve your fingerstyle-picking is practicing your favorite professional fingerpickers' songs and imitating their skills. I have two reasons for this opinion.1. you will be able to continue practicing as long as the song you're practicing is favorite one.-To practice the guitar, patience is quite important.  I've seen many friends gave up playing guitars because they couldn't find the guitarists and songs they can really respect and like. The passion that you want to play some favorite songs madly can let you practice until you get better.2.You can learn many kinds of great skills from them.-I strongly recommend you not only to listen to their songs but also to see their playing movies and imitate their hands' movement. Especially, if they've published some lesson DVDs, your practices can be much productive and fun.",
  "short_answers": [
   "practicing your favorite professional fingerpickers' songs and imitating their skills"
  ]
 },
 "Quora-295521": {
  "sentences": [
   "It’s not weird at all.",
   "People need to be comfortable in their own company; it’s a mark of maturity.",
   "I promise that no one will care or notice what you’re doing."
  ],
  "full_text": "It’s not weird at all. Bring a book, a newspaper or a tablet to read, or sit at the bar. I promise that no one will care or notice what you’re doing. And if they do, so what? Why do you care what strangers think of you?I go out to eat by myself fairly regularly. My boyfriend lives far away from me and my work schedule means that I’m off when a lot of my friends are working, and vice versa. So if I want to go out to eat, this can often mean doing it by myself. It has the added advantage of giving me sole control over where and when I eat, I’m not guilted into ordering something I don’t really want, and I can leave when I want or stay as long as I want. There’s this strange idea that unless you’re doing something “with someone,” it’s weird or socially out of bounds or makes you a loser. People need to be comfortable in their own company; it’s a mark of maturity.",
  "short_answers": [
   "It’s not",
   "People need to be comfortable in their own company",
   "no one will care or notice"
  ]
 },
 "Quora-007203": {
  "sentences": [
   "You don't find your soulmate, you develop one.",
   "It starts with noticing someone in your life who attracts you."
  ],
  "full_text": "You don't find your soulmate, you develop one. It starts with noticing someone in your life who attracts you. Then as you get to know them you find compatibility between your two personalities, characters, and values, goals, preferences, etc. As you develop a relationship with this person, you and your partner both learn a lot about each other, figure out how to anticipate and resolve conflicts, adapt into constructive communication styles, and become precious to each other as you become even better suited for each other over time as you share a growing string of positive memories together. That's how you get a soulmate. I hope this helps and I wish you well. Comment or send a message if you have more to say / ask, follow me if you'd like to keep up, and check out my Quora blog. :)",
  "short_answers": [
   "develop one",
   "noticing someone in your life who attracts you"
  ]
 },
 "Quora-073494": {
  "sentences": [
   "Hopefully he didn’t spend much of his life wasting it in preparation for an afterlife that he now knows is not coming.",
   "Instead, maybe he lived, and is content with what he did with the years he had.",
   "Sing your death song and die like a hero going home."
  ],
  "full_text": "Lots of good answers here. I’ll just add this. Hopefully he didn’t spend much of his life wasting it in preparation for an afterlife that he now knows is not coming. Instead, maybe he lived, and is content with what he did with the years he had. Then he can comfortably enjoy the time he has left, with no regrets. And then maybe he feels like this:\"When it comes your time to die, be not like those whose hearts are filled with the fear of death, so that when their time comes they weep and pray for a little more time to live their lives over again in a different way. Sing your death song and die like a hero going home. ” - Chief Tecumseh, Shawnee Nation",
  "short_answers": [
   "he didn’t spend much of his life wasting it in preparation for an afterlife",
   "content with what he did with the years he had",
   "die like a hero going home"
  ]
 },
 "Quora-237717": {
  "sentences": [
   "Dopamine levels and the structure of dopamine receptors underlie this temperament difference between Introverts and Extraverts (On the Psychobiology of Personality)."
  ],
  "full_text": "Dopamine levels and the structure of dopamine receptors underlie this temperament difference between Introverts and Extraverts (On the Psychobiology of Personality). In broad strokes, Introverts have high baseline levels of cognitive stimulation and arousal even at rest and thus are constantly trying to avoid any additional visual and social stimuli. So when they're trying to concentrate, nearby noises or people are additional stimuli that becomes distracting and pushes them over their optimal level of arousal. Extraverts, on the other hand, are at a constant arousal deficit and require extra stimuli to compensate and bring them to their optimal level. So they seek out places with lots of people, loud music, or interesting visuals. ",
  "short_answers": [
   "Dopamine levels and the structure of dopamine receptors"
  ]
 },
 "Quora-181315": {
  "sentences": [
   "I may be wrong but he can probably bench press his bodyweight easy."
  ],
  "full_text": "Chris Hemsworth is a young Australian born actor. He is famous for his role as Thor, the mythical character. He is 6′3, 200-pound actor and seems to be in good physical shape. So as for the bench press, this powerlifting exercise is not necessarily the only method to gauge absolute strength. I may be wrong but he can probably bench press his bodyweight easy. He looks very fit. Don't be fooled by CGI stuff. I mean don't be fooled by computer generated character enhanced movie stars. It is all an illusion.",
  "short_answers": [
   "his bodyweight"
  ]
 },
 "Quora-092706": {
  "sentences": [
   "There are already a lot of good answers here such as drinking coffee, something with sugar, taking breaks, taking short naps, studying with a friend, take a cold shower when you’re about to lose the fight to stay awake, and listening to upbeat music.",
   "One solution you might want to consider is taking Modafinil."
  ],
  "full_text": "There are already a lot of good answers here such as drinking coffee, something with sugar, taking breaks, taking short naps, studying with a friend, take a cold shower when you’re about to lose the fight to stay awake, and listening to upbeat music. As some have mentioned, pulling all nighters isn’t the best way to actually learn and retain information. When you’re tired, it’s difficult to comprehend new material let alone remember any of it. One solution you might want to consider is taking Modafinil. It’s a drug many people use to stay awake and alert. People who sleep way too much are often prescribed this drug to keep them awake. It also increases focus and memory. Many people, like programmers, use it when they need to get a ton of stuff done.",
  "short_answers": [
   "drinking coffee, something with sugar, taking breaks, taking short naps, studying with a friend, take a cold shower when you’re about to lose the fight to stay awake, and listening to upbeat music",
   "taking Modafinil"
  ]
 },
 "Quora-162792": {
  "sentences": [
   "You enhance your debugging skill when you encounter and solve problems.",
   "In order for that to happen you should challenge yourself by programming something you never did, you will surely have at least one difficulty.",
   "And finally, see code written by other good programmers, it will help you understand the efficient/ right ways to write code."
  ],
  "full_text": "Experience, Experience and Experience. You enhance your debugging skill when you encounter and solve problems. In order for that to happen you should challenge yourself by programming something you never did, you will surely have at least one difficulty. As well I would recommend to learn something new constantly. And finally, see code written by other good programmers, it will help you understand the efficient/ right ways to write code. When you find something you don't understand research it and its common uses that way you can learn quite well. Sometimes it may be hard to find good code examples but you can search for open source projects and YouTube tutorials (done by professionals).Or if you struggle a lot finding/ understanding what you need to achieve you can ask a freelancer to write you a script/ program that will include comments to explain every bit.",
  "short_answers": [
   "encounter and solve problems",
   "challenge yourself by programming something you never did",
   "see code written by other good programmers"
  ]
 },
 "Quora-229940": {
  "sentences": [
   "I would never stop loving my passion for writing."
  ],
  "full_text": "I would never stop loving my passion for writing. Whatever the circumstances , however hard things are going to get there’s a fear that keeps me awake at night, that one day I would wake up and wouldn’t have written a single novel yet. It’s this exact fear that lets me dream. It’s this dream that would never stop my passion for writing.",
  "short_answers": [
   "my passion for writing"
  ]
 },
 "Quora-024302": {
  "sentences": [
   "That said, if you can find your boss doing something illegal or vastly against company rules and discretely snap a photo of him/her doing it, print it out and leave it anonymously with HR.",
   "If you know your boss has a weakness for something illegal, create a situation where it would be easy for him/her to give in to temptation."
  ],
  "full_text": "I can't imagine why you'd want to do this because you'll probably go down the tubes with the boss. And if they are that terrible a boss you should already be in talks with HR. That said, if you can find your boss doing something illegal or vastly against company rules and discretely snap a photo of him/her doing it, print it out and leave it anonymously with HR. Do not photoshop it; it will be closely analyzed. If you know your boss has a weakness for something illegal, create a situation where it would be easy for him/her to give in to temptation. Be there to document and take photos. I guess I am not very creatively devious; I tend to follow the channels when I want action even though it doesn't always work.",
  "short_answers": [
   "find your boss doing something illegal or vastly against company rules and discretely snap a photo of him/her doing it",
   "your boss has a weakness for something illegal, create a situation where it would be easy for him/her to give in to temptation"
  ]
 },
 "Quora-275043": {
  "sentences": [
   "The reason people talk this way is because they consider this to be “hip” and “trendy”.",
   "The media promotes saying these things.",
   "Celebrities say these things."
  ],
  "full_text": "The reason people talk this way is because they consider this to be “hip” and “trendy”. The media promotes saying these things. Celebrities say these things. So saying these things must be cool. In the end, people just use these phrases and words so much that it pretty much gets integrated into their dictionary. It becomes a habit, and like all habits, it's not easy to change.",
  "short_answers": [
   "they consider this to be “hip” and “trendy”",
   "saying these things must be cool",
   "The media promotes saying these things"
  ]
 },
 "Quora-260839": {
  "sentences": [
   "You’ll get the occasional dirty look from more right-wing Americans, especially if you’re out in the countryside, and a fair number of people will probably assume you are trying to be “edgy” rather than actually expressing any real support of or understanding of, communist ideology."
  ],
  "full_text": "T-shirts bearing the likeness of Che Guevara were so popular for a while that they became their own fashion trend. Collecting and displaying retro-kitsch, including communist retro-kitsch, is also its own subculture. You’ll get the occasional dirty look from more right-wing Americans, especially if you’re out in the countryside, and a fair number of people will probably assume you are trying to be “edgy” rather than actually expressing any real support of or understanding of, communist ideology.",
  "short_answers": [
   "occasional dirty look",
   "people will probably assume you are trying to be “edgy”"
  ]
 },
 "Quora-282327": {
  "sentences": [
   "If your point and shoot is a Canon, buy a Canon, if it's a Nikon, buy a Nikon because you will be amazed at how familiar everything is."
  ],
  "full_text": "If your point and shoot is a Canon, buy a Canon, if it's a Nikon, buy a Nikon because you will be amazed at how familiar everything is.  The configuration of the camera isn't as important as the lenses, for top notch photography you need the best glass.  Buy the most camera you can afford and buy the lenses that seem too expensive, the pro glass.  The most expensive camera can't fix a marginal lens, not even with Photoshop.  I see that photographers are writing about ergonomics - not so important to me, when it comes down to it I adapt to the camera.  Something that feels like plastic to one person may feel like titanium to another.  This stuff is just tools.",
  "short_answers": [
   "Canon",
   "Nikon"
  ]
 },
 "Quora-201836": {
  "sentences": [
   "Get a driver’s licence.",
   "As soon as we turn sixteen, we rush out to take the test and squeal when the license comes in."
  ],
  "full_text": "Get a driver’s licence. For many of us, it’s much like a rite of passage. As soon as we turn sixteen, we rush out to take the test and squeal when the license comes in. We practise as much as we can so that we can be free to come and go where we want, when we want. Personally, I’d like one so that I’d have a half-hour car ride home instead of an hour and a half bus ride home. My birthday is coming up, so hopefully I’ll be able to start driving soon.",
  "short_answers": [
   "driver’s licence",
   "take the test and squeal when the license comes in"
  ]
 },
 "Quora-274774": {
  "sentences": [
   "Acturally, Quora is not a famous Website for most of the chinese netizen.",
   "So luckly, little influence give us a lax supervision."
  ],
  "full_text": "Acturally, Quora is not a famous Website for most of the chinese netizen. And if you loading Quora with a IP address of chinese area, you will receive a message which reminds you must use english whenever answering or asking a questinon, so the language is a huge problem for most chinses use Quora. So luckly, little influence give us a lax supervision.",
  "short_answers": [
   "not a famous Website",
   "ittle influence"
  ]
 },
 "Quora-265076": {
  "sentences": [
   "Scallops are very challenging because they vary week by week, day by day, and even batch by batch.",
   "Skin on fish seems to be a struggle for most people because you want it crispy."
  ],
  "full_text": "Scallops are very challenging because they vary week by week, day by day, and even batch by batch. One will sear perfectly in a nice hot pan and the next will need some finesse, maybe some butter, maybe a new screaming hot pan, and the next will burn on said nice hot pan. They constantly change so you have to adjust and not ever be on autopilot. Skin on fish seems to be a struggle for most people because you want it crispy. Lipid is gross and burnt is burnt. Crispy is the goal.",
  "short_answers": [
   "Scallops",
   "Skin on fish"
  ]
 },
 "Quora-076456": {
  "sentences": [
   "The British army at the time were professional in a way that most of the other European troops were not.",
   "But they did have good discipline and they did have strong musket drills and decent, well maintained weapons."
  ],
  "full_text": "Just to add the other answers so far are good but to be honest too complicated. The British army at the time were professional in a way that most of the other European troops were not. They were not necessarily braver or stronger or somehow superhuman. They were almost always lower in numbers. But they did have good discipline and they did have strong musket drills and decent, well maintained weapons. If they could stand and keep up a decent rate of fire (3 rounds per minute as above) then the attacking columns could be made to fail",
  "short_answers": [
   "he British army at the time were professional",
   "they did have good discipline",
   "they did have strong musket drills and decent, well maintained weapons"
  ]
 },
 "Quora-091156": {
  "sentences": [
   "Yes from the scientific point of view, makes no sense to doubt it.",
   "So, is not only harder to fake than to do in reality, is impossible."
  ],
  "full_text": "Yes from the scientific point of view, makes no sense to doubt it. Many papers and new scientific discoveries about the Moon, directly following from the expeditions they did there. They brought back rocks from the Moon - and each rock was labelled so you can tell where it was picked up and when. And they lead to new and surprising discoveries about the Moon. And these rocks are used to this day, re-examined to test theories and ideas. So, is not only harder to fake than to do in reality, is impossible. We couldn't fake it today, never mind with 1960s technology.",
  "short_answers": [
   "Yes"
  ]
 },
 "Quora-158262": {
  "sentences": [
   "It was very interesting work and satisfying, in that it unquestionably served the interests of my country.",
   "It is a career that affords you great opportunities to see the world, but it also demands much from families."
  ],
  "full_text": "I was a career diplomat. It was very interesting work and satisfying, in that it unquestionably served the interests of my country. Foreign Service officers often do not get the respect of uniformed service members, but it is also dangerous work. I was wounded in an assassination attempt, and my wife was nearly struck by a rifle-propelled grenade. It is a career that affords you great opportunities to see the world, but it also demands much from families. A JD program is usually helpful preparation for a diplomatic career. The Foreign Service doesn’t pay as much as large law practices. On the other hand, a lot of attorneys go unemployed. I suggest prayer. What purpose does God will for your life?",
  "short_answers": [
   "very interesting work and satisfying",
   "great opportunities to see the world"
  ]
 },
 "Quora-152287": {
  "sentences": [
   "Well no you didn’t do anything wrong.",
   "You were just being more blunt in your approach."
  ],
  "full_text": "Well no you didn’t do anything wrong. You were just being more blunt in your approach. Sometimes being too straightforward and too blunt makes people a little offended and may cause them to become a bit defensive in their answers. To them, it feels like if you were commanding or demanding them to give them something that you want. All people need is a little reminder, not a demand. All you need to do is to rephrase your message a bit to a more “less blunt” and more neutral way.",
  "short_answers": [
   "you didn’t do anything wrong",
   "You were just being more blunt"
  ]
 },
 "Quora-062914": {
  "sentences": [
   "Japan is a friend of the US because it is politically, strategically and economically smart for it be friends with the US."
  ],
  "full_text": "Japan is a friend of the US because it is politically, strategically and economically smart for it be friends with the US.  It's really that simple.   You are talking about an event that took place before most of our lifetimes. If every country in the world held grudges over events of the past then our world economy would slide to a grinding halt.",
  "short_answers": [
   "it is politically, strategically and economically smart"
  ]
 },
 "Quora-011710": {
  "sentences": [
   "The engineers that worked in my groups never really did their own development."
  ],
  "full_text": "The engineers that worked in my groups never really did their own development. They only wanted tools that they could use to solve their problems ASAP. I dint know if that applies everywhere but I would suspect so. Whereas the creative part of science is discovering something new, the creative part of engineering appears to be discovering the best existing formulas and equations.",
  "short_answers": [
   "never"
  ]
 },
 "Quora-119903": {
  "sentences": [
   "The difference is the feeling that exists behind the act.",
   "In other words, love making is still sex, but not all sex is love making."
  ],
  "full_text": "The difference is the feeling that exists behind the act. Nothing more. Any type of sex, from vanilla to extreme, is making love if love is what the people feel for each other. In other words, love making is still sex, but not all sex is love making. Either one is perfectly fine, as long as all participants are consenting adults.",
  "short_answers": [
   "the feeling that exists behind the act",
   "love making is still sex, but not all sex is love making"
  ]
 },
 "Quora-013952": {
  "sentences": [
   "You can’t prove a concept does not exist in reality.",
   "In other words, god is not proven… your job is done."
  ],
  "full_text": "You can’t prove a concept does not exist in reality. You may be able to disprove specific claims of god, on a case by case basis. First and foremost, “god” needs to be very clearly defined… like anything that is being debated or studied. Take unicorns… no one can prove to a court of law that they don’t exist (anywhere, in the infinite universe). Or even that they didn’t once live somewhere on Earth. Or that one didn’t. I mean, a horse and a narwhal could have hooked up, once or twice. Even if you could inventory and account for every atom in the universe (and say no unicorn fossils exist), evidence is lost to time. Most gods are claimed to be supernatural, that is beyond science, beyond nature. So this is the wrong question… as a society we need to DEMAND that EVERYONE provide evidence for ANY CLAIM being made. Especially when the issue is a matter of public policy. We should ONLY accept facts as a basis for establishing truth. In other words, god is not proven… your job is done. The believers need to prove it, or accept it’s a matter of faith, and hence has no place in public policy.",
  "short_answers": [
   "You can’t prove a concept does not exist in reality",
   "god is not proven"
  ]
 },
 "Quora-054772": {
  "sentences": [
   "If you have enough money/income of your own, then move out anyways.",
   "Find other female roommates to live with, perhaps, that may help with some of your parents’ concerns."
  ],
  "full_text": "If you have enough money/income of your own, then move out anyways. Find other female roommates to live with, perhaps, that may help with some of your parents’ concerns. It sounds like you may be battling a cultural battle as well as your parents’ ideas, but don’t let that stop you, either.",
  "short_answers": [
   "move out",
   "Find other female roommates to live with"
  ]
 },
 "Quora-111987": {
  "sentences": [
   "Technically no.",
   "There is no way of proving the non-existence of things."
  ],
  "full_text": "Technically no. There is no way of proving the non-existence of things. For example we cannot prove that god doesn’t exist. This results in what is called “the burden of proof” Philosophical burden of proof - Wikipedia , which means you cannot claim that Harry Potter exists and then tell others to “prove me wrong”. I hope, in all brevity, that this makes sense.",
  "short_answers": [
   "no",
   "There is no way"
  ]
 },
 "Quora-000005": {
  "sentences": [
   "Almost all animals alive today are successfully evolved, apart from a few things like the tuatara which has been largely left behind by evolution because it lives on a sheltered, isolated island."
  ],
  "full_text": "Almost all animals alive today are successfully evolved, apart from a few things like the tuatara which has been largely left behind by evolution because it lives on a sheltered, isolated island. Some species do get shafted because conditions change suddenly and more rapidly than they can adapt to, usually because some human introduced cats into their environment - but most were well-adapted to the conditions which existed *before* that sudden change. Nor are we the most successfully evolved animal, since we tend to destroy our own environment and then starve. The best adapted mammal is either the brown rat or the house mouse, and the best-adapted animal overall will be whatever the most common species of nematode is.",
  "short_answers": [
   "all animals alive today are successfully evolved"
  ]
 },
 "Quora-226239": {
  "sentences": [
   "Take Bruce Lee's or the mixed martial artist's approach.",
   "The most important ones are (in no order) wrestling, jiu jitsu, muay thai, and boxing.",
   "More specifically, study the martial arts that are used in MMA fighting."
  ],
  "full_text": "Take Bruce Lee's or the mixed martial artist's approach. Study all of them. More specifically, study the martial arts that are used in MMA fighting. The most important ones are (in no order) wrestling, jiu jitsu, muay thai, and boxing. Those are the best ones, but you shouldn't ignore the other valuable techniques and skills of the more obscure arts like kung fu or aikido. Most martial arts are incomplete, focusing on one position or aspect of of self defense. Muay thai focuses on striking skills and the stand up position, jiu jitsu focuses submission holds and ground positioning, and wrestling focuses on opponent control in any position.",
  "short_answers": [
   "Bruce Lee's or the mixed martial artist's approach",
   "wrestling, jiu jitsu, muay thai, and boxing",
   "the martial arts that are used in MMA fighting"
  ]
 },
 "Quora-037639": {
  "sentences": [
   "Brown sugar is really no different, nutritionally, than white sugar.",
   "Both are essentially just calories and sweetness."
  ],
  "full_text": "Brown sugar is really no different, nutritionally, than white sugar. Brown sugar has a tiny amount of potassium and an even smaller amount of sodium (in terms of RDA) and white sugar does not.  The amount is so small that you'd have to eat cups of sugar a day for it to make any difference. Both are essentially just calories and sweetness. Brown sugar tastes different, though.",
  "short_answers": [
   "Brown sugar is really no different",
   "Both are essentially just calories and sweetness"
  ]
 },
 "Quora-192802": {
  "sentences": [
   "Category theory is not considered controversial in any way.",
   "It is a fundamental part of mathematics since the 1950’s."
  ],
  "full_text": "Category theory is not considered controversial in any way. It is a fundamental part of mathematics since the 1950’s. The language of category theory has become part of standard mathematical discourse even among mathematicians who don't use the results of category theory itself. Few mathematicians employ the Yoneda lemma, but every mathematician understands what “functor” means. The only reasons I can imagine why you'd think there's any controversy are:You may have heard the term “abstract nonsense”. This is a light-hearted, tongue-in-cheek reference to the universal aspect of category theory. It doesn't signify a controversy regarding either the validity or the significance of any category-theoretic argument. It takes some care to set up the set-theoretic foundations of category theory, which naively deals with proper classes such as “the category of all groups”. This isn't hard to do, and doesn't leave the theory in a foundational crisis.",
  "short_answers": [
   "Category theory is not considered controversial",
   "a fundamental part of mathematics"
  ]
 },
 "Quora-281079": {
  "sentences": [
   "It is ok for ANYONE to read Harry Potter.",
   "It is important that nobody refuses to read a particular book just because they consider themselves too young, or too old."
  ],
  "full_text": "It is ok for ANYONE to read Harry Potter. Be it at 1 year old all the way to 100 years old. So anyone can read it. It is important that nobody refuses to read a particular book just because they consider themselves too young, or too old. You might be 68 years old and you want to read a book abut Dora the Explorer. Absolutely fine. You might be 8 years old and you want to read Finnegans Wake by James Joyce. Absolutely fine.",
  "short_answers": [
   "It is ok"
  ]
 },
 "Quora-174246": {
  "sentences": [
   "Any way, find a speech therapist and stick to them.",
   "All others stuff like speech therapists, supporting environment is also essential, but nothing will ever work (like in my case), if you give up (which I did)."
  ],
  "full_text": "Lots n lots of patience (which clearly I lack). All others stuff like speech therapists, supporting environment is also essential, but nothing will ever work (like in my case), if you give up (which I did). Any way, find a speech therapist and stick to them. Go everyday, or whatever is the schedule and do all your exercises. Don't ever skip a session. BREATH. BREATH. BREATH. Unless your cause is neurogenic, breathing correctly will help solve most of it. Breathing correctly relaxes your mind, lungs and in-turn relaxes your speech organs. ",
  "short_answers": [
   "speech therapists",
   "supporting environment",
   "BREATH"
  ]
 },
 "Quora-097372": {
  "sentences": [
   "You were justified, but you’re still at risk of getting into a lot of trouble."
  ],
  "full_text": "I’m assuming you’re male. If so, this is the fucked up thing. You were justified, but you’re still at risk of getting into a lot of trouble. She violated your personal space and body autonomy against your explicit wishes; as far as I’m concerned, if someone does that, it’s go time. If the genders were reversed, people would be unanimously applauding you for your assertiveness. Hell, I would be applauding your assertiveness. But that isn’t the case; you’re male, which means you need to move fast and start getting in touch with people. Speak to HR; speak to your supervisor. Practise articulating your side of the story. Cover every decision you made.",
  "short_answers": [
   "You were justified"
  ]
 },
 "Quora-044290": {
  "sentences": [
   "They cause undue suffering to those hit by one and that is against the laws of war as set by the Geneva conventions but more importantly thinknof it likenthis the battlefield lifespan of a flamethrower operator was about 18 seconds."
  ],
  "full_text": "They cause undue suffering to those hit by one and that is against the laws of war as set by the Geneva conventions but more importantly thinknof it likenthis the battlefield lifespan of a flamethrower operator was about 18 seconds. A: . no one wants to be burned alive so they target FT operators 1stB: the flamethrower weighed 98lbs loaded and had 2 tanks 1 with fuel and 1 with propellant but both pressurized to about 100psi so 1 hit to that bomb strapped tonyour back and it not only takes you out but about 4 other guys around you",
  "short_answers": [
   "They cause undue suffering to those hit by one",
   "against the laws of war",
   "lifespan of a flamethrower operator was about 18 seconds"
  ]
 },
 "Quora-177726": {
  "sentences": [
   "The Element by Ken Robinson, which discusses how you don’t have to fit into the norm or a categorical box as society dictates but may find your calling in another talent that cannot be academically nor financially quantifiable.",
   "I also read The Alchemist many years ago and while I thought the writing was really simple and minimalist."
  ],
  "full_text": "The Element by Ken Robinson, which discusses how you don’t have to fit into the norm or a categorical box as society dictates but may find your calling in another talent that cannot be academically nor financially quantifiable. Totally worth the read if you’re someone who does not excel in a traditional education system but is nonetheless ambitious. I also read The Alchemist many years ago and while I thought the writing was really simple and minimalist. I think it was purposely presented that way in order to be relatable for the masses and also remain sticky. A quote I’m still reminded of, more than 10yrs later, which is almost like a form of prayer when good things are on the horizon:Submit“When you want something, the whole world conspires in helping you achieve it”The Diary of Anne Frank is also a great motivational ready, indirectly, as is Viktor Frankl and “Man’s Search for Meaning.”",
  "short_answers": [
   "The Element",
   "Alchemist"
  ]
 },
 "Quora-096833": {
  "sentences": [
   "If Hitler had not killed himself he would have eventually have been captured by the Russians if he had stayed in his Berlin bunker and eventually hung after the Nuremberg trials."
  ],
  "full_text": "If Hitler had not killed himself he would have eventually have been captured by the Russians if he had stayed in his Berlin bunker and eventually hung after the Nuremberg trials. If he had decided to leave for South America in April 1945 it's possible he could have lived the rest of his life out in Brazil or Argentina. But having said that, Hitler knew if he lost the war he would have no future. There was nothing for him to have lived for, he was finished. It was always all or nothing with Hitler right to the very end.",
  "short_answers": [
   "he would have eventually have been captured by the Russians",
   "hung after the Nuremberg trials"
  ]
 },
 "Quora-111276": {
  "sentences": [
   "Commander Neal Armstrong was the first man to walk on the moon by virtue of the fact that the door prevented Buzz Aldrin from stepping out first, however because of the bulky suits neither of them managed to do the moonwalk on the moon so that still hasn't been done yet."
  ],
  "full_text": "Commander Neal Armstrong was the first man to walk on the moon by virtue of the fact that the door prevented Buzz Aldrin from stepping out first, however because of the bulky suits neither of them managed to do the moonwalk on the moon so that still hasn't been done yet. As for on the earth the first person was cab Callaway in the 1930’s where it was called The Buzz. It wasn't until Michael Jackson the king of Pop that it was made popular under the name the moonwalk. Interesting anecdote: the worm has been performed on the moon. You can see the astronauts do it in the videos every time they fall over. It's a fact!",
  "short_answers": [
   "Commander Neal Armstrong"
  ]
 },
 "Quora-011454": {
  "sentences": [
   "Ensure Plus is effective.",
   "Also, pay closer attention to calories on the nutritional facts.",
   "Increase calorie intake with Ensure Plus or sneak in more pasta and you may notice a significant difference in a fairly short period of time."
  ],
  "full_text": "Ensure Plus is effective. Also, pay closer attention to calories on the nutritional facts. If you have always been skinny, you may not realize how few calories you take in daily. Increase calorie intake with Ensure Plus or sneak in more pasta and you may notice a significant difference in a fairly short period of time. And if you really do want to make yourself fat, this strategy will work for that too, just give it some time. Rome wasn't built in a day. Best of luck.",
  "short_answers": [
   "Ensure Plus",
   "closer attention to calories on the nutritional facts",
   "Increase calorie intake"
  ]
 },
 "Quora-211453": {
  "sentences": [
   "I do not share my wife.",
   "But I’m not “sharing” her; she is choosing to have other lovers, and I’m totally okay with that.",
   "If people choose to be married but not monogamous, yes, that’s totally okay, as long as all the parties involved are on board with it."
  ],
  "full_text": "I share my van. I share my computer mouse. I share my tent. I do not share my wife. The difference between my wife and these other things is these other things are my property. My wife is not. My wife has other lovers. But I’m not “sharing” her; she is choosing to have other lovers, and I’m totally okay with that. If people choose to be married but not monogamous, yes, that’s totally okay, as long as all the parties involved are on board with it. But I don’t like thinking about it in terms of “sharing” people. Language matters; the language we use both shapes and communicates the way we see the world. I don’t “share” people because I don’t think people are property.",
  "short_answers": [
   "I do not share my wife",
   "I’m not “sharing” her"
  ]
 },
 "Quora-025061": {
  "sentences": [
   "You can eat a light lunch which will help.",
   "You can also build in a small amount of exercise: stretching, a short walk.",
   "You can also deliberately set a timer for a work period."
  ],
  "full_text": "Many people have a down cycle after lunch. You can eat a light lunch which will help. That way your body isn’t processing a heavy load of carbs and not as much energy is spent in the digestion of your meal. You can also build in a small amount of exercise: stretching, a short walk. Exercise helps digestion and helps improve your overall energy level. You can also deliberately set a timer for a work period. There is a method called the Pomodoro method you can check out which lets you set a clock and at the end of that time, you stop your work, rest for 5 minutes and then reset the clock. This method has been scientifically proven to help people be more productive.",
  "short_answers": [
   "eat a light lunch",
   "exercise",
   "set a timer for a work period"
  ]
 },
 "Quora-205771": {
  "sentences": [
   "Milind Soman, a Bollywood actor completed this race in 15 hours and 19 minutes at the age of 50."
  ],
  "full_text": "This guy is not only an athlete but an actor too. There is an event called Ironman Triathlon which a a series of long-distance triathlon races organized by the World Triathlon Corporation (WTC), consisting of a 2.4-mile (3.86 km) swim, a 112-mile (180.25 km) bicycle ride and a marathon run of 26.22-mile (42.20 km), without a break. There is a cutoff duration of 17 hours, races completed after that time are not considered. The person who completes the race within 17 hours is given the title ‘Ironman’. Milind Soman, a Bollywood actor completed this race in 15 hours and 19 minutes at the age of 50.",
  "short_answers": [
   "Milind Soman"
  ]
 },
 "Quora-184610": {
  "sentences": [
   "There really is no reason to embarrass him by telling you know.",
   "If you don’t want to go out with him, just tell him you’re not interested."
  ],
  "full_text": "There really is no reason to embarrass him by telling you know. You may be disgusted, but you’re not in a relationship with him, so it’s not cheating. His actions involve full-consent from the other women - unless of course, he begins to harass them - and involves an activity many healthy couples partake in all the time. If you don’t want to go out with him, just tell him you’re not interested. Telling him you know and what you know will probably make you look like the snooping, crazy lady.",
  "short_answers": [
   "no reason to embarrass him",
   "just tell him you’re not interested"
  ]
 },
 "Quora-281345": {
  "sentences": [
   "Because most of the people who write movies where someone needs protecting are men, and everyone wants to be the hero of the story they're writing."
  ],
  "full_text": "Because most of the people who write movies where someone needs protecting are men, and everyone wants to be the hero of the story they're writing. Ergo, most heroes we see on screen are men. When we see women in the position of protector, its usually in a more metaphorical sense, or a terrible one- dimensional character who is too “cool” or “edgy” to have a love interest who could be threatened. And anyway even if she did the writers wouldn't threaten him because that would make him less manly and we can't have that! (But if the heroine and her lover are gay then kill the lover, no prob!)",
  "short_answers": [
   "most of the people who write movies where someone needs protecting are men"
  ]
 },
 "Quora-207637": {
  "sentences": [
   "Expanded Universe: Sidious, due to force mastery and sheer ability.",
   "In canon, Sidious would still win, but that is just because of sheer experience."
  ],
  "full_text": "Expanded Universe: Sidious, due to force mastery and sheer ability. He mastered the force storm, which is very possibly the hardest technique in the universe to perfect. Luke, while powerful, just could not stand up to the sheer power of hate that Darth Sidious could wield as a weapon. In canon, Sidious would still win, but that is just because of sheer experience.",
  "short_answers": [
   "Sidious"
  ]
 },
 "Quora-256543": {
  "sentences": [
   "One exception from my residency training stands out, in which bile splashed into my face during a procedure involving the liver.",
   "I definitely felt the need to step away and wash up thoroughly."
  ],
  "full_text": "As a radiologist, my patient interaction occurs during procedures, some of which entail sticking a needle into a part of the body or a tube into the rectum. I’m not entirely sure why, but I am rarely if ever grossed out by the sight of blood, stool, or other body fluids. I suspect it has something to do with the high level of focus needed during a procedure; my mind and eyes are too occupied with the task at hand to be affected by any blood and guts action. One exception from my residency training stands out, in which bile splashed into my face during a procedure involving the liver. I definitely felt the need to step away and wash up thoroughly.",
  "short_answers": [
   "bile splashed into my face"
  ]
 },
 "Quora-004086": {
  "sentences": [
   "The Rhodes Scholarship is the most competitive academic prize available to undergraduates (0.7% acceptance rate according to The Rhodes Scholarship Trust)."
  ],
  "full_text": "The Rhodes Scholarship is the most competitive academic prize available to undergraduates (0.7% acceptance rate according to The Rhodes Scholarship Trust). As such, it is clearly the most prestigious accomplishment, even when compared to receiving a degree from Harvard (probably the most selective University in the world at a 5% acceptance rate).",
  "short_answers": [
   "Rhodes Scholarship"
  ]
 },
 "Quora-276552": {
  "sentences": [
   "Great executives get “it” done.",
   "The great executives are the ones that ultimately are able to push past obstacles and deliver results."
  ],
  "full_text": "There’s an old tale of Steve Jobs hiring a new VP and showing them to their new office. When they walk in Steve Jobs sees that the office hasn’t been cleaned for the new hire so he stops a janitor walking by and asks them why the office hasn’t been cleaned. The janitor responds that he couldn’t get into the office which is why he didn’t clean it. Steve Jobs thanks the janitor and when he is out of ear shot turns to the VP and says:“This is the difference between you and a janitor”Simply put. Great executives get “it” done. There are so many complexities to a business. Strategy, execution, hiring, firing, personnel, politics, culture, alignment, etc. The great executives are the ones that ultimately are able to push past obstacles and deliver results.",
  "short_answers": [
   "Great executives get “it” done",
   "able to push past obstacles and deliver results"
  ]
 },
 "Quora-163653": {
  "sentences": [
   "Because there are only a very limited number of places available, and admission is very difficult."
  ],
  "full_text": "Because there are only a very limited number of places available, and admission is very difficult. At the undergraduate level, it is very difficult for an non-European student to be admitted into a program at ETHZ. There are special requirements for anyone not having a Swiss high school diploma. Once you're in, typically half of the first year cohort do not make it into the second year. At the postgraduate level, you are competing against students from the rest of the world for a very limited number of places. You'd see Americans, but they are not disproportionately more numerous than othe European and Chinese students.",
  "short_answers": [
   "limited number of places available",
   "admission is very difficult"
  ]
 },
 "Quora-227230": {
  "sentences": [
   "That is correct, yes.",
   "If you’re not allowed to do it, you can’t ask someone else to.",
   "Shabbat is supposed to be a day off for everyone — even your animals — and so it’s not fair to ask someone outright to do something that you can’t do."
  ],
  "full_text": "That is correct, yes. If you’re not allowed to do it, you can’t ask someone else to. Shabbat is supposed to be a day off for everyone — even your animals — and so it’s not fair to ask someone outright to do something that you can’t do. Of course, there’s a way around this, and it’s to ask by implication. Not allowed: “I can’t turn on the light switch because I’m Jewish, can you?”Allowed: “boy, it sure is dark in here! And since I’m Jewish, I’m not allowed to turn on the switch. That switch, the one right over there.”This distinction isn’t in the Torah, but rather the Talmud (also called “Oral Law”), the commentaries and discussion on the laws in the Torah. Traditional Jews believe that the Oral Law also comes directly from God, and was simply written down much later, and so give it the full weight of divine authority. Liberal Jews, generally, do not believe this about the Talmud (for some, not even the Torah!), and therefore do not feel bound by its rulings.",
  "short_answers": [
   "That is correct",
   "yes",
   "you can’t ask someone else to"
  ]
 },
 "Quora-062396": {
  "sentences": [
   "First and foremost I must tell you that that's perfectly normal, not smart, but perfectly normal."
  ],
  "full_text": "First and foremost I must tell you that that's perfectly normal, not smart, but perfectly normal. They made money. You wasted time. let's get done with that. Now you must delete that TV series and think abt what u r gonna do with all the free space u got on ur clock. Asking this question reveals very much abt you . some bad things. Some good. You are not crazy. You are now just one step away from having a life u won't regret later. All the very best.",
  "short_answers": [
   "that's perfectly normal",
   "not smart, but perfectly normal"
  ]
 },
 "Quora-187490": {
  "sentences": [
   "The answer is No.",
   "They don't want to, because they feel a part of India."
  ],
  "full_text": "The answer is No. I can tell you this with utmost conviction and confidence. Don't judge me. I ain't saying that if they want to join China, it's wrong. I don't think so. It's a democratic nation and we are free to think what we will to. They don't want to, because they feel a part of India. Many have already settled in \"mainland\" cities such as Bangalore, Delhi, Mumbai. In Bangalore, there are defined localities where you will only find people from the north east. Same goes with Delhi as well.",
  "short_answers": [
   "No",
   "They don't want"
  ]
 },
 "Quora-126234": {
  "sentences": [
   "If she is not ready to even talk about your feelings (or lack thereof), it is better to let this girl go with dignity."
  ],
  "full_text": "I completely disagree with Ankeeta Dahiya’s answer to this question. Just because one person had a fairy tale love story doesn't mean that every arranged marriage goes that way. If she is not ready to even talk about your feelings (or lack thereof), it is better to let this girl go with dignity. I'm not one to quickly suggest breakups on small issues but this is not even a breakup. Yes people will be hurt, but it's very insensible to risk ruining your life with an incompatible partner just so everyone could live in a fake bubble of happiness. So, please, talk.",
  "short_answers": [
   "let this girl go"
  ]
 },
 "Quora-004905": {
  "sentences": [
   "So someone called you a loser, tell him/her you are not one."
  ],
  "full_text": "Well well well,You know what?Where the greatest pleasure in life lies?In doing things people said you can’t!. So someone called you a loser, tell him/her you are not one. But not using your mouth, rather through your deeds!Because actions speak louder than words!",
  "short_answers": [
   "tell him/her you are not one"
  ]
 },
 "Quora-260010": {
  "sentences": [
   "There is SO much evidence, from so many different research organisations, using a vast variety of methodologies, over a considerable time scale (we’re talking 1.5 million years here via analysis of ice cores) and even using different modelling, they ALL come to the same conclusion."
  ],
  "full_text": "No. That’s the simple answer. There is SO much evidence, from so many different research organisations, using a vast variety of methodologies, over a considerable time scale (we’re talking 1.5 million years here via analysis of ice cores) and even using different modelling, they ALL come to the same conclusion. The unprecedented changes in our current climate and overall global warming, rise in sea temperature and sea levels are caused by man burning fossil fuels. We need to switch to renewable energy, massively reduce consumerism and stop the wanton destruction of our forests.",
  "short_answers": [
   "No."
  ]
 },
 "Quora-258774": {
  "sentences": [
   "Pointless, perhaps, as well as probably unconstitutional because of the religion clause."
  ],
  "full_text": "Pointless, perhaps, as well as probably unconstitutional because of the religion clause. Interestingly, the order singles out Syria as the only country of origin restricted. No Syrian-born person has ever been involved in a terrorist attack in the United States, according to the heritage foundation. Terror Plots Against the US by Country of Origin. That chart doesn’t seem to be completely accurate, since Wikipedia says “The hijackers in the September 11 attacks were 19 men affiliated with al-Qaeda. 15 of the 19 were citizens of Saudi Arabia, and the others were from the United Arab Emirates (2), Egypt and Lebanon.”So if you really want to limit terrorism in the US you would stop immigration and entry from Saudi Arabia. In addition to being a major source of terrorists Saudi Arabians are a major source of support and financing for ISIS (which, like the Saudis, is from the Sunni branch of Islam.)But wait. The Saudis are wealthy. We buy a lot of oil from them. I guess we’re all willing to put up with the risk of terrorism as long as they sell us oil and come to the US to buy diamonds in New York and personal jets from Boeing, right?",
  "short_answers": [
   "Pointless, perhaps, as well as probably unconstitutional"
  ]
 },
 "Quora-097552": {
  "sentences": [
   "You won’t like my answer but here goes ,get out, get a job.",
   "Go to work.",
   "Put your 2 year old in the hands of a loving responsible person who loves parenting."
  ],
  "full_text": "You won’t like my answer but here goes ,get out, get a job. Put your 2 year old in the hands of a loving responsible person who loves parenting. You certainly aren’t doing the child any favors staying home and resenting the situation. Might be harming depending on how well you disguise your distaste for parenting. A happy Dad is going to be better for child. Go to work.",
  "short_answers": [
   "get out, get a job",
   "Go to work",
   "Put your 2 year old in the hands of a loving responsible person"
  ]
 },
 "Quora-223226": {
  "sentences": [
   "Zlatan was the best player in the title winning Milan side.",
   "If we factor in the performance at the international level, then Forlan has to be the best."
  ],
  "full_text": "Zlatan was the best player in the title winning Milan side. Villa didn't have a similar impact at Barca. Etoo is still in the discussion. And then there is Forlan. At club level they are pretty close. If we factor in the performance at the international level, then Forlan has to be the best.",
  "short_answers": [
   "Zlatan",
   "Forlan"
  ]
 },
 "Quora-232922": {
  "sentences": [
   "No.",
   "The US would never do such a thing.",
   "The US also wouldn't want to give up trading partners."
  ],
  "full_text": "No. The US would never do such a thing. It would make the US so weak that Russia could sweep in on Europe. It would make the US a small military power, other than the nuclaer weapons. The US also wouldn't want to give up trading partners. Even if the US does pull out of NATO, they still would support Europe because of the threat of Russia. If Russia takes Europe, it will not be good for The USA. So overall, no. This would be stupif for everybody. Hope this helps.",
  "short_answers": [
   "No",
   "never",
   "The US also wouldn't want to give up trading partners"
  ]
 },
 "Quora-054744": {
  "sentences": [
   "Because he’s not as courteous and gracious as she is.",
   "He’s a joker, and some of his jokes are insulting or racist.",
   "He breaks the boundaries of formal protocol required by diplomacy, while she is the consummate diplomat."
  ],
  "full_text": "Because he’s not as courteous and gracious as she is. He’s a joker, and some of his jokes are insulting or racist. He breaks the boundaries of formal protocol required by diplomacy, while she is the consummate diplomat. He’s that one awkward uncle that everyone has in the family. You have to invite him to family occasions, but you really wish you didn’t because you know he’s going to embarrass you.",
  "short_answers": [
   "he’s not as courteous and gracious as she is",
   "He’s a joker",
   "He breaks the boundaries of formal protocol required by diplomacy."
  ]
 },
 "Quora-190580": {
  "sentences": [
   "“The term was coined by Id software within the context of its game,” that game being Doom."
  ],
  "full_text": "So I did some digging and the first instance of the word spawn being used as a term to dictate where the player would start (spawn) at the beginning of a game was in Doom. “The term was coined by Id software within the context of its game,” that game being Doom. This came with other things like respawning, spawning, camping, etc. hope this answers your question.",
  "short_answers": [
   "The term was coined by Id software within the context of its game"
  ]
 },
 "Quora-143086": {
  "sentences": [
   "An overdose of Benzos such as Diazepam or Lorazepam, alternatively an overdose of prescription sleeping tablets."
  ],
  "full_text": "An overdose of Benzos such as Diazepam or Lorazepam, alternatively an overdose of prescription sleeping tablets. With each method you would start by feeling warm and cosy before quickly drifting off into a sleep that you would never wake up from. One way that many people try is an overdose of Paracetamol, this is a mistake as it can take a few days to die from Paracetsmol overdose, a few days during which many regret there action. Unfortunately the damage is probably already done and your liver will fail but before you die you will suffer from unbearable anxiety, it's an awful way to go out.",
  "short_answers": [
   "An overdose of Benzos such as Diazepam or Lorazepam",
   "an overdose of prescription sleeping tablets"
  ]
 },
 "Quora-188660": {
  "sentences": [
   "Of course we'll never know for sure.",
   "So it seems likely that at least some slave holders would have continued to profit from slavery for at least another 100 years.",
   "For sure, a lot more people would have lived in slavery if it had not been abolished during the Civil War."
  ],
  "full_text": "Of course we'll never know for sure.  But who would have abolished slavery in the US southern states?  And when?  Remember that the South seceded, and then attacked Ft. Sumpter, in spite of Lincoln's repeated assurances that he didn't want to abolish slavery in the south. Cotton farming remains profitable in the south.  And cotton farming still used cheap, manual, black labor in the 1950s, when I was visiting my grandparents' farm in Mississippi.  So it seems likely that at least some slave holders would have continued to profit from slavery for at least another 100 years. For sure, a lot more people would have lived in slavery if it had not been abolished during the Civil War.",
  "short_answers": [
   "we'll never know for sure",
   "some slave holders would have continued to profit from slavery",
   "a lot more people would have lived in slavery"
  ]
 },
 "Quora-013163": {
  "sentences": [
   "Targaryens are not impervious to fire.",
   "In fact, during the Dance of the Dragons, at least two Targaryens died from fire related wounds."
  ],
  "full_text": "Targaryens are not impervious to fire. In fact, during the Dance of the Dragons, at least two Targaryens died from fire related wounds. In the books, Daenerys has all of her hair singed off due to dragon fire. The television series, I have a feeling, is written by people who are not book readers. I am sure that they have some kind of outline or rough copy of the finished books, but the finer details are occasionally overlooked. The show will get it right in the end. It may be frustrating for book readers, but part of the problem is GRRM has not released the final two books. Most people are forgetting that Viserys was burned to death with molten hot gold in season one, which makes Daenerys seem somewhat ridiculous to attentive watchers.",
  "short_answers": [
   "not impervious to fire",
   "two Targaryens died from fire related wounds"
  ]
 },
 "Quora-285298": {
  "sentences": [
   "This, of course, lies on subjective views but I assume intelligent people enjoy anime more than others because it's their exit from the world we live in while being entranced by something that is usually intelligently created."
  ],
  "full_text": "Anime is a medium which transcends the mundane expectations for entertainment. The plot and characters that anime entails are both captivating and eccentric to the individual. This, of course, lies on subjective views but I assume intelligent people enjoy anime more than others because it's their exit from the world we live in while being entranced by something that is usually intelligently created.",
  "short_answers": [
   "it's their exit from the world we live in while being entranced by something that is usually intelligently created"
  ]
 },
 "Quora-082160": {
  "sentences": [
   "A lot of people would freak out and people would immediately seek shelter if they’re out in the cold.",
   "Then after a few days, if clothing reappeared, Goodwill would be inundated and people would happily stay nude on their own."
  ],
  "full_text": "A lot of people would freak out and people would immediately seek shelter if they’re out in the cold. Here in Florida where it’s almost always warm enough to be more comfortable naked than clothed, after the initial freak out people would just say “this is weird”. Then after a while they’d be saying “this is nice” and “what was the big deal about being naked before”? Then after a few days, if clothing reappeared, Goodwill would be inundated and people would happily stay nude on their own.",
  "short_answers": [
   "immediately seek shelter",
   "people would happily stay nude on their own"
  ]
 },
 "Quora-179380": {
  "sentences": [
   "App Inventor is a great resource for complete beginners that have never worked with code before."
  ],
  "full_text": "App Inventor is a great resource for complete beginners that have never worked with code before. This educational tool teaches programming fundamentals through a drag-and-drop interface that makes “coding” more fun and easier to understand. The best part about App Inventor is that you build real apps as you learn. The tool is not only a learning exercise, but a compiler that converts your projects into working Android applications.",
  "short_answers": [
   "App Inventor"
  ]
 },
 "Quora-072492": {
  "sentences": [
   "Love means to serve the beloved person unconditionally.",
   "I serve you not with motive to enjoy you, what ever yours liking , they are mine, I do things because you like that."
  ],
  "full_text": "You want to know the meaning of true love? First try to understand the meaning of LOVE ,the word most used and least understood. So what is love? Does love mean that you like a girl/boy and roam around with him/her, have cup of coffee,tea together or finds each other presence comfortable. These are the superficial symptoms which can be or cannot be of LOVE. Then what is Love? Love means to serve the beloved person unconditionally. The following line explains it clearly--\". I serve you not with motive to enjoy you, what ever yours liking , they are mine, I do things because you like that. I think, I see, I listen,I work, I fight, I touch, I eat and I create only for you, and in all these I find satisfaction and happiness\".",
  "short_answers": [
   "serve the beloved person unconditionally",
   "I do things because you like that"
  ]
 },
 "Quora-290100": {
  "sentences": [
   "Trump is not ending the Visa Waiver Program.",
   "However, aliens who do not require visas, such as most citizens of VWP countries, will be unaffected."
  ],
  "full_text": "Trump is not ending the Visa Waiver Program. Trump is ending the Visa Interview Waiver Program. Therefore, aliens who require visas in order to enter the US will now have to attend in-person interviews. However, aliens who do not require visas, such as most citizens of VWP countries, will be unaffected. Note that it’s not Trump’s fault that a citizen of a VWP country who is also a citizen of, say, Syria, requires a visa to visit the US. That restriction was enacted by Congress during Obama’s term.",
  "short_answers": [
   "Trump is not ending the Visa Waiver Program",
   "most citizens of VWP countries, will be unaffected"
  ]
 },
 "Quora-281830": {
  "sentences": [
   "Obsessive-compulsive disorder, or OCD, is an anxiety disorder that generally causes extreme discomfort."
  ],
  "full_text": "Obsessive-compulsive disorder, or OCD, is an anxiety disorder that generally causes extreme discomfort. Sufferers are often riddled with persistent and recurrent impulses, thoughts and images that are unwanted. According to the National Institute for Mental Health, OCD affects more than 2million adults in the United States. Severe cases of OCD can cause an extreme amount of distress, and the disorder can dramatically interfere with a person’s daily life. Sufferers of OCD are generally very anxious and emotional. They display many non- OCD symptoms, such as signs of depression, excessive worry,extreme tension, and the constant feeling that nothing is ever right. Aside from the obvious compulsive behaviors a person with OCD displays, there are no physical signs of this disorder; however, a person with OCD can develop physical problems. For example, a person with a germ obsession may wash their hands so much that the skin on them becomes red, raw and painful. A person with OCD may experience multiple short-term effects, including the inability to function as a contributing member of society, difficulties at school or work,or trouble maintaining friendships or romantic relationships. The long-term effects of OCD generally develop due to the poor quality of life that most extreme sufferers have. Long-term effects include depression, constant anxiety and an increased risk of substance abuse.",
  "short_answers": [
   "Obsessive-compulsive disorder",
   "an anxiety disorder"
  ]
 },
 "Quora-056412": {
  "sentences": [
   "One of the best ways of dealing with these is to be proactive.",
   "Make sure your child isn't hungry, thirsty or tired.",
   "If you go out, make sure you have snacks and drink, and do not go out at nap time."
  ],
  "full_text": "One of the best ways of dealing with these is to be proactive. Make sure your child isn't hungry, thirsty or tired. If you go out, make sure you have snacks and drink, and do not go out at nap time. Offer food before the meltdown, hand her a drink, put her down for a nap before she gets over tired. This will pass, but ONLY if it never works. By that I mean, never give in to the tantrum. If you are out somewhere and she starts, calmly pick her up. Say this is not a good way to behave, carry her back to your car and go home. If that means leaving a full cart of groceries, so be it. If she does it at home, ignore her, but keep her safe. By that I mean do not let her throw things or crash into things. I used to sit on the floor and pull my child into my arms, my legs over hers, my arms crossed over her arms. I wasn't holding her down, I was holding her safe. I didn't talk to her during this, stayed calm, and I kept my head up so she couldn't head butt me. Once she realizes that tantrums will not get her what she wants, she will stop, and it probably won't even take too long. I had five children, but only had to deal with this a few times. I think the older ones told the younger ones to forget it, as it didn't work. With children, you can say no 99 times. If you say yes once, the child will only learn that it worked once, and will keep trying the behavior you don't like. Be strong, be consistent and stay calm. My kids would sometimes yell, I hate you! I would reply, that's okay, I love you. I'd hear, You're mean! I'd reply, yes, I am, but I love you. See the humor in it and know it's just a passing phase. Good luck!",
  "short_answers": [
   "be proactive",
   "Make sure your child isn't hungry, thirsty or tired",
   "do not go out at nap time"
  ]
 },
 "Quora-238910": {
  "sentences": [
   "I don't see why not.",
   "My sister and I shared a place when her boys were young, and if asked I always answered honestly."
  ],
  "full_text": "I don't see why not. My sister and I shared a place when her boys were young, and if asked I always answered honestly. If it was something they weren't sure they liked, I'd have them help me prepare it. That way, they would at least try something “they” made. However, my sister's answer to “What's for supper, mum?” usually was answered simply by “Food.” At around the age of seven, my nephew rolled his eyes, and said, “Oh no! Not again!” In reality, I was making one of his favourite meals, and he all but licked his plate.",
  "short_answers": [
   "I don't see why not",
   "I always answered honestly"
  ]
 },
 "Quora-017985": {
  "sentences": [
   "I'd vote for the better politician.",
   "In the end though, if they truly are identical, it shouldn't matter who I vote for."
  ],
  "full_text": "I'd vote for the better politician. If all factors are identical, then I might shift to the atheist one, simply because I am one. In my opinion, an atheist president won't allow religion or disputes of that matter get in that way either; they'll be more focused on running the country. In the end though, if they truly are identical, it shouldn't matter who I vote for.",
  "short_answers": [
   "I'd vote for the better politician",
   "if they truly are identical, it shouldn't matter who I vote for"
  ]
 },
 "Quora-156604": {
  "sentences": [
   "The specific answer is, Jesus is not black and that will never happen Jesus was once a person who have set his real foot on the soil of this planet he was no black he was a Jew, what confuse people?."
  ],
  "full_text": "I am black and very black even though black is not my race, I am African Zulu. So I am very confident with my answer for this question. The specific answer is, Jesus is not black and that will never happen Jesus was once a person who have set his real foot on the soil of this planet he was no black he was a Jew, what confuse people?. If you are black believing in the worse black theoritical Jesus you are in deep trouble. Jesus is only for his nation…",
  "short_answers": [
   "he was no black"
  ]
 },
 "Quora-028599": {
  "sentences": [
   "It has to be this jaywalking thing.",
   "One day I thought about googling it, and found that in the US, aswell as most countries around the world, its illegal to cross the road if not at a marked crossing.",
   "I have been abroad and never heard the term jaywalking but it seems ridicualous that it is illegal to cross the road."
  ],
  "full_text": "It has to be this jaywalking thing. I, as a British person, born and brought up and still living in the UK had never heard of the term jaywalking until a few years ago, and then, it was only in films. I would generally just ignore that part of a movie, it someone said here was a jaywalker or something similar, as I hadn't a clue what it was. One day I thought about googling it, and found that in the US, aswell as most countries around the world, its illegal to cross the road if not at a marked crossing. Punishments vary from fines to even short jail terms. I have been abroad and never heard the term jaywalking but it seems ridicualous that it is illegal to cross the road. In the UK, we can cross the road pretty much wherever we like unless otherwise stated at the time and place. We instead teach our children how to cross the road safely. Which seems better.",
  "short_answers": [
   "jaywalking",
   "its illegal to cross the road if not at a marked crossing",
   "it seems ridicualous that it is illegal to cross the road"
  ]
 },
 "Quora-146029": {
  "sentences": [
   "It certainly seems that she’s encouraging you to invite her to spend some more time together."
  ],
  "full_text": "It certainly seems that she’s encouraging you to invite her to spend some more time together. So if you’re interested in getting back with your ex, then you should take her up on it. Is she ready to get back together again NOW? It’s perhaps premature, she might want to wait until the “third date”.",
  "short_answers": [
   "she’s encouraging you to invite her to spend some more time together"
  ]
 },
 "Quora-187020": {
  "sentences": [
   "Nursing and medicine are not the same professions.",
   "If you want to be a doctor, go be a doctor.",
   "If you want to be a nurse, go be a nurse."
  ],
  "full_text": "No. Nursing and medicine are not the same professions. Nursing is difficult and difficult to get into in the US. I can’t speak for other countries. If you want to be a doctor, go be a doctor. If you want to be a nurse, go be a nurse. Nurses can also have masters or doctoral level independent practices as advanced practice nurses (Nurse Practitioners, Certified Nurse Midwives, Certified Registered Nurse Anest. and Clinical Nurse Specialists) with take beyond bachelors level (RN) education, clinicals, theses/DNP level activity and then an examination for the license. Then ongoing continuing education and practice hours.",
  "short_answers": [
   "Nursing and medicine are not the same",
   "want to be a doctor, go be a doctor",
   "want to be a nurse, go be a nurse"
  ]
 },
 "Quora-180615": {
  "sentences": [
   "This is due to a whole variety of factors including male dominated societies and outdated notions about women's brains being fickle and simple (an idea which astoundingly survived the Victorians...)."
  ],
  "full_text": "In the modern world, educating women to the same level as men is a fairly recent idea. This is due to a whole variety of factors including male dominated societies and outdated notions about women's brains being fickle and simple (an idea which astoundingly survived the Victorians...).  Genius = Inherent Talent + Education, so therefore no education means no genius. * *exceptions to this are families powerful/rich enough and forward thinking enough to educate their girls.",
  "short_answers": [
   "male dominated societies",
   "outdated notions about women's brains being fickle and simple"
  ]
 },
 "Quora-271349": {
  "sentences": [
   "The easiest way to explain it is that baking soda is a base—it’s alkaline.",
   "Baking powder is a mixture of baking soda and a dry acid, such as cream of tartar, and perhaps some cornstarch to help keep the two separate and dry."
  ],
  "full_text": "Baking soda and baking powder are both leaveners used in baking, but they are chemically different. The easiest way to explain it is that baking soda is a base—it’s alkaline. Baking powder is a mixture of baking soda and a dry acid, such as cream of tartar, and perhaps some cornstarch to help keep the two separate and dry.",
  "short_answers": [
   "baking soda is a base—it’s alkaline",
   "Baking powder is a mixture of baking soda and a dry acid"
  ]
 },
 "Quora-149139": {
  "sentences": [
   "I don't think it was rigged, but the internet is certainly exploding with conspiracy theories to try to convince people otherwise; That final touchdown should not have been awarded to the Patriots.",
   "That just doesn't happen in pro football, does it?"
  ],
  "full_text": "I don't think it was rigged, but the internet is certainly exploding with conspiracy theories to try to convince people otherwise; That final touchdown should not have been awarded to the Patriots. The Refs called a TD, the confetti started falling down, everyone started storming the field, and by then it was too late to review the play. But they did review it. I watched it. And the game was called because the officials made a good call, not because they were anxious to put that horse into the barn and toss the Lombardi trophy into the hands of an undeserving team. That just doesn't happen in pro football, does it?",
  "short_answers": [
   "I don't think it was rigged",
   "That just doesn't happen"
  ]
 },
 "Quora-158196": {
  "sentences": [
   "If that is your measurement we can say that Jennifer Aniston is at the top.",
   "For a few years after Friends it might have been a tie with Matthew Parry as he had quite a few Rom-Coms under his belt out the door."
  ],
  "full_text": "The only way you could think any of them suffered is if your measurement is “Who still makes the cover of People Magazine regularly”. If that is your measurement we can say that Jennifer Aniston is at the top. She has the highest number of “recognizable” films on her resume and is permanently linked to any drama relating to Brad Pitt. For a few years after Friends it might have been a tie with Matthew Parry as he had quite a few Rom-Coms under his belt out the door. Then he went back to TV. Several guest appearances on big shows like The Good Wife, West Wing. Before staring in his own series. (Mr. Sunshine, Go On, The Odd Couple).",
  "short_answers": [
   "Jennifer Aniston",
   "Matthew Parry"
  ]
 },
 "Quora-151341": {
  "sentences": [
   "She was christened Elizabeth Alexandra Mary."
  ],
  "full_text": "As other respondents have pointed out, there is no Queen of England. I will, however, assume you are referring to Queen Elizabeth II, the Queen of the United Kingdom and Head of the Commonwealth. She was christened Elizabeth Alexandra Mary. Even then, whilst her father was the Duke of York, she would not have had a conventional surname in the same way as the rest of us. Had her father not become King, she would have remained Princess Elizabeth of York in the same way that the current Duke of York’s daughters are Princess Beatrice of York and Princess Eugenie of York. In recent times it has become more usual for such ducal names to be adopted as surnames in certain, less formal, situations. For example as Charles is the Prince of Wales, his sons would be Prince William (or Henry - Harry’s real name) of Wales, but when they entered the armed forces, and probably, also at school, they were known as William Wales and Harry Wales. The Queen doesn't need a surname, who else in the world could anyone mean when referring to Queen Elizabeth the second?",
  "short_answers": [
   "christened Elizabeth Alexandra Mary"
  ]
 },
 "Quora-227760": {
  "sentences": [
   "If you would like to see who visited your Facebook page, you can use SocialFans site."
  ],
  "full_text": "If you would like to see who visited your Facebook page, you can use SocialFans site. It is a very useful profile analysis tool for Facebook. It has a very strong algorithm which helps you to find out the users who recently viewed your Facebook profile/page. The viewers list of this app is updated each hour so that you can see the most recent users who viewed your profile.",
  "short_answers": [
   "you can use SocialFans site"
  ]
 },
 "Quora-073834": {
  "sentences": [
   "No, and I don’t think they ever will.",
   "The personality type that seems to be related to computer science fields are largely introverted (myself included) and do not value parties, homecomings, proms, etc."
  ],
  "full_text": "No, and I don’t think they ever will. By “cool” I assume you mean the kids that are social and have a lot of friends. The personality type that seems to be related to computer science fields are largely introverted (myself included) and do not value parties, homecomings, proms, etc. Most high school kids don't understand CS and don't see how cool it really is. This isn't going to change; the kids with social skills will always be the cool kids in high school — regardless of what classes he/she takes. No matter how cool or up-and-coming a field is doesn't mean the people interested in it are automatically cool.",
  "short_answers": [
   "No",
   "I don’t think they ever will",
   "The personality type that seems to be related to computer science fields are largely introverted"
  ]
 },
 "Quora-186678": {
  "sentences": [
   "Don't.",
   "Please don't.",
   "Finish your schooling (it won't be much longer if you are in 12th grade) and then you can ask anyone you choose to go out with you."
  ],
  "full_text": "Don't. Please don't. If the teacher has given you the idea that he or she is interested in you romantically then the teacher is behaving in a manner that is TOTALLY unacceptable and should be fired. If the teacher has not, in any way, led you to believe this, then save yourself and the teacher from embarrassment and step back. Finish your schooling (it won't be much longer if you are in 12th grade) and then you can ask anyone you choose to go out with you. Good luck with your studies!",
  "short_answers": [
   "Don't",
   "Finish your schooling"
  ]
 },
 "Quora-073295": {
  "sentences": [
   "The Nazis shot people, but that wasted ammunition and was detrimental to the Nazi morale.",
   "The process was so efficient that a prisoner could arrive at a camp and be gassed 2 hours later.",
   "Gas was also cheaper than ammunition and faster than shooting or starvation."
  ],
  "full_text": "The Nazis shot people, but that wasted ammunition and was detrimental to the Nazi morale. Plus, believe it or not, it’s a very slow process if you want to wipe out an entire population. You need to have thousands of men shooting people all over the empire to achieve your goal. The Nazis didn’t have the time for that. So, they came up with the gas chamber. You could stick a whole group of people in there, turn a nob and all are dead. It’s easy and efficient. The process was so efficient that a prisoner could arrive at a camp and be gassed 2 hours later. Gas was also cheaper than ammunition and faster than shooting or starvation.",
  "short_answers": [
   "It’s easy and efficient",
   "faster than shooting or starvation"
  ]
 },
 "Quora-142824": {
  "sentences": [
   "Most of the times, Yes!",
   "But yeah, I always write names of others and not mine so I doodle without worries ( and its more exciting when one of my classmate is caught because he has writen his name on desk while nobody knows who on Earth did that)."
  ],
  "full_text": "Most of the times, Yes! And there is no problem with that. I mean this is the one and only way to kill time when all those stupid lectures bounces above my head. The best tool is pen, of course! Engraving all those song lyrics or names (or some abusing words ) does make feel better. Walk around a bit and you could easily spot desks which seems more likely to built of words instead of wood in our classes. So, go on until a teacher caught you doing that and then scolding with hundereds of humiliating words (even which I will ignore if I will ever get taught). But yeah, I always write names of others and not mine so I doodle without worries ( and its more exciting when one of my classmate is caught because he has writen his name on desk while nobody knows who on Earth did that). Enough said!",
  "short_answers": [
   "Yes",
   "Most of the times",
   "write names of others and not mine so I doodle without worries"
  ]
 },
 "Quora-113642": {
  "sentences": [
   "So each imported movie or tv show is an english lesson.",
   "In school they try to teach us british english but we still sound more american."
  ],
  "full_text": "Swedish is such a small language that it’s not profitable to hire voice actors to dub all imported movies and tv shows like they do in larger european countries. Instead it’s all in English but with Swedish subtitles. So each imported movie or tv show is an english lesson. Also it often makes sense just to import another american high quality show than to try and compete with shows in Swedish, so we get a lot of it. In school they try to teach us british english but we still sound more american.",
  "short_answers": [
   "movie or tv show is an english lesson",
   "In school they try to teach us british english"
  ]
 },
 "Quora-173934": {
  "sentences": [
   "In the United States this is a Federal felony, and you can go to jail for up to five years(and probably a hefty fine too, in addition to state charges)."
  ],
  "full_text": "In the United States this is a Federal felony, and you can go to jail for up to five years(and probably a hefty fine too, in addition to state charges). As I have heard of people on the ground, even in their own homes, being caught doing this, I would guess they have some sort of laser direction finding equipment, possibly on board the aircraft.",
  "short_answers": [
   "you can go to jail"
  ]
 },
 "Quora-232373": {
  "sentences": [
   "Simply put, their inventions aren't advertised.",
   "And, if it's an ancient invention, the inventor is often portrayed as a white person."
  ],
  "full_text": "Simply put, their inventions aren't advertised. And, if it's an ancient invention, the inventor is often portrayed as a white person. Kinda hard to get a good view of black inventions if the blacks are shown as white people or not talked about at all. The other thing to consider is that during the 1500s - 1890s Blacks throughout the world were often dealing with slavery, fighting to get out of slavery or fighting to prevent slavery.",
  "short_answers": [
   "their inventions aren't advertised",
   "the inventor is often portrayed as a white person"
  ]
 },
 "Quora-081070": {
  "sentences": [
   "It means he’s arrogant and entitled.",
   "He is being very condescending - assuming that you will be waiting around and available to him if and when he might decide to date you.",
   "He’s telling you openly that he sees you as an option."
  ],
  "full_text": "It means he’s arrogant and entitled. He is being very condescending - assuming that you will be waiting around and available to him if and when he might decide to date you. It’s a power play. He’s telling you openly that he sees you as an option. You’re an item in the supermarket that he might put in his basket, but he has other items to consider. Is this how you see yourself?Could you really be interested in someone who sees you like this?",
  "short_answers": [
   "he’s arrogant and entitled",
   "He is being very condescending",
   "he sees you as an option"
  ]
 },
 "Quora-179761": {
  "sentences": [
   "Catholics believe that the authority to administer the Church of Jesus Christ and its ordinances (such as baptism and the sacrament) was passed down from Jesus to Peter and the Apostles to others and later Bishops and Popes and Cardinals and Priests in an unbroken succession.",
   "Protestants believe that the authority was lost somewhere along the way because the Catholic Church had become corrupt and was no longer teaching the pure Gospel that Jesus had taught."
  ],
  "full_text": "Catholics believe that the authority to administer the Church of Jesus Christ and its ordinances (such as baptism and the sacrament) was passed down from Jesus to Peter and the Apostles to others and later Bishops and Popes and Cardinals and Priests in an unbroken succession. Protestants believe that the authority was lost somewhere along the way because the Catholic Church had become corrupt and was no longer teaching the pure Gospel that Jesus had taught. The dealt with the need for God’s authority by developing the doctrine of the “Priesthood of all believers,” or a Universal priesthood. That is the core difference - other doctrinal differences generally stem from this central disagreement coupled with the differences in Biblical interpretation that divide all churches and sects.",
  "short_answers": [
   "Protestants believe that the authority was lost somewhere along the way",
   "the differences in Biblical interpretation"
  ]
 },
 "Quora-181396": {
  "sentences": [
   "There’s nothing wrong with having sex before marriage, or just sex period, and never getting married."
  ],
  "full_text": "There’s nothing wrong with having sex before marriage, or just sex period, and never getting married. Humans beings evolved to have strong sexual urges, to have intense orgasms, multiple orgasms even, and these urges, which are perfectly normal and natural, want to be satisfied as often as possible, preferably with a partner. Having sexual intimacy with a partner is far more pleasurable, and can be extremely bonding and healthy to a couple, but even without a relationship, having someone to satisfy these urges is still healthy and beneficial, but if you don't have a partner, then masturbation can be very pleasurable as well.",
  "short_answers": [
   "There’s nothing wrong with having sex before marriage"
  ]
 },
 "Quora-088412": {
  "sentences": [
   "It is impossible to get work-life balance because balance is something that you do, not something that you have.",
   "You learn that as a dancer; balance requires constant effort (though we try to make it look effortless).",
   "Just when you feel like you have figured out the right balance for one set of circumstances, they will shift again."
  ],
  "full_text": "It is impossible to get work-life balance because balance is something that you do, not something that you have. You learn that as a dancer; balance requires constant effort (though we try to make it look effortless). The balance between work and life that is right for you will change constantly, as some parts of your life become more intense and interesting and others become less worthy the time and effort they require. Just when you feel like you have figured out the right balance for one set of circumstances, they will shift again. Personally, I try to enjoy the challenge of balancing my work and the rest of my life. If it were easy, it wouldn’t be nearly as interesting.",
  "short_answers": [
   "because balance is something that you do, not something that you have",
   "balance requires constant effort",
   "they will shift again"
  ]
 },
 "Quora-210148": {
  "sentences": [
   "Heat is kinetic energy, the energy manifest in the molecular vibration of molecules.",
   "Energy is the ability to do work so heat is energy."
  ],
  "full_text": "Heat is kinetic energy, the energy manifest in the molecular vibration of molecules. The faster the molecules vibrate, the higher the temperature gets, the more energy available to do work. Like balls on a pool table, the hot, fast moving molecules bump into the slower ones transferring some kinetic energy and raising the temperature. If you store heat directly say by heating up a block of steel so it’s red hot then dropping it into water thus boiling the water to make steam and drive a piston, you have converted the kinetic (heat) energy in the hot steel into work. Energy is the ability to do work so heat is energy. The concepts of work, energy and heat are interrelated but not intuitive so it’s understandable that you might have some confusion about what is what. You are about to have an Aha! moment, keep going…",
  "short_answers": [
   "kinetic energy",
   "heat is energy"
  ]
 },
 "Quora-294818": {
  "sentences": [
   "So we can't even reach the speed of light."
  ],
  "full_text": "For any object that starts at rest, it takes infinite energy to reach the speed of light. That's more energy than we have in the observable universe. So we can't even reach the speed of light.",
  "short_answers": [
   "we can't"
  ]
 },
 "Quora-142995": {
  "sentences": [
   "My husband and I have constant fights about who’s friends do we hang out with."
  ],
  "full_text": "Kayla Greenhalge Omg! Haha so relatable especially the changing diapers one! My husband and I have constant fights about who’s friends do we hang out with. His friends are the type that likes to watch a game and drink. Sadly neither I or my friends are into that :/We fought way too often about it and decide to meet in middle ground and use Milofy, the couple dating app. We’ve gone on a few double dates and really gelled along with the other couple. Phew! was that a good decision!",
  "short_answers": [
   "about who’s friends do we hang out with"
  ]
 },
 "Quora-287245": {
  "sentences": [
   "No.",
   "They all say no to guys one time or the other.",
   "No is normal."
  ],
  "full_text": "No. They all say no to guys one time or the other. You can't expect to get a yes everytime. Asking girls out is a game of numbers. You might approach five ladies, make great conversations with 3 or 4 of them if you're really good at it. Get the number of 3 and set a date with them. Then, one or two might find the time for you. No is normal. Get okay with it.",
  "short_answers": [
   "No",
   "They all say no to guys",
   "No is normal"
  ]
 },
 "Quora-096698": {
  "sentences": [
   "Yes.",
   "There should definitely be."
  ],
  "full_text": "Yes. There should definitely be. It(the film itself) is a vastly more accurate, more reality-grounded portrayal of a brave group guerrillas championing a cause worth fighting for(and dying for) struggling against daunting odds. Watch the movie. relate to all the characters there. And feel the overall drama.",
  "short_answers": [
   "There should definitely be",
   "Yes"
  ]
 },
 "Quora-058998": {
  "sentences": [
   "I would take it seriously snd will devise a plan to get better.",
   "I would employ everything- medical, psychological and complimentary therapies.",
   "Good to work on relationship with yourself."
  ],
  "full_text": "Love to you, shining soul!. I would take it seriously snd will devise a plan to get better. I would employ everything- medical, psychological and complimentary therapies. Good to work on relationship with yourself. Concept of Inner Child will help. You can Google it. Also we do forgiveness exercise during IYS therapy. This helps to heal the past. So never say never. Everything is possible when we are willing to work on ourselves :)One example: A teacher from my school had a horrible depression all her life. She was often suicidal and feeling useless. Using all the resources : medical, psychology as well as our IYS therapy she is able now to lead happy life, works as a registered nurse, has nice partner and is a prominent teacher and a therapist in our school.",
  "short_answers": [
   "take it seriously snd will devise a plan to get better",
   "employ everything- medical, psychological and complimentary therapies",
   "work on relationship with yourself"
  ]
 },
 "Quora-248944": {
  "sentences": [
   "You're a little blind like we've all been, but I assume you're spending most of your time together anyway so it's not crazy."
  ],
  "full_text": "You're a little blind like we've all been, but I assume you're spending most of your time together anyway so it's not crazy. My one piece of advice is to make sure you have a friend you can stay with in case things go sideways. You never want to be in a situation that you can't walk away from. Good luck and stay safe.",
  "short_answers": [
   "it's not crazy"
  ]
 },
 "Quora-173127": {
  "sentences": [
   "Not usually.",
   "It's hugely expensive to do so.",
   "If the destination airport is new to the airline, it don't believe that it would be be uncommon that one or more pilots fly the approach and landing in a simulator to check there are no unusual things to think about."
  ],
  "full_text": "Not usually. It's hugely expensive to do so. If the destination airport is new to the airline, it don't believe that it would be be uncommon that one or more pilots fly the approach and landing in a simulator to check there are no unusual things to think about. There are a small number of major airports in the world that have tricky approaches I'm not a pilot but I believe this broadly amounts to not always being able to just fly in a straight line while descending towards the runway. I think this is usually due to mountains etcetera in the surrounding area making a straight line approach difficult some of the time.",
  "short_answers": [
   "Not usually",
   "It's hugely expensive",
   "fly the approach and landing in a simulator"
  ]
 },
 "Quora-148784": {
  "sentences": [
   "Usually prisoners are really tolerant of people with mental illnesses.",
   "They are treated well nowadays.",
   "Didn't use to be so, but they are now."
  ],
  "full_text": "Mentally ill prisoners are treated better by the prisoner population than they are by administration. Usually prisoners are really tolerant of people with mental illnesses. But accidents always happen. As far as treatment of mentally ill prisoners goes…if the psychiatric staff determines that you are mentally ill you will be going to some prison where they specialize in treating high security mentally ill prisoners. Nowadays they even have therapy programs for those kinds of guys in there. They separate them from the general population and allow them to see psychiatrists and psychologists and have them go to different therapy groups, etc. They are treated well nowadays. Didn't use to be so, but they are now.",
  "short_answers": [
   "prisoners are really tolerant of people with mental illnesses",
   "They are treated well",
   "Didn't use to be so, but they are now"
  ]
 },
 "Quora-227701": {
  "sentences": [
   "We don't want a separate nation.",
   "So we don't want a separate country."
  ],
  "full_text": "We don't want a separate nation. Why should we want a separate nation when we already have one? India is ours too, as much as others. We have contributed a lot to the Indian Freedom Movement. You know, way before the first war of Independence in 1857, we had revolted against the English on a massive scale during 1806 which was recorded as the 'Vellore Mutiny'. We have given the country a number of Presidents! From Rajaji to Dr. APJ Abdul Kalam! So being in a state of 2100 km down south of Delhi and speaking a language different from theirs does not mean that we are a mere annexure to this vast country. We are also MAINLAND INDIA. So we don't want a separate country.",
  "short_answers": [
   "We don't want"
  ]
 },
 "Quora-080340": {
  "sentences": [
   "Indefinitely.",
   "The ships ran out of ammunition and couldn't ram each other."
  ],
  "full_text": "Indefinitely. The battle between the two Ironsides off the coast of Maryland during the Civil war ended in a draw. Why? The ships ran out of ammunition and couldn't ram each other. Any ship firing iron ball ammunition is not going to have the armor penetration of a ship firing shaped AP ammo. And iron balls were meant to smash through wood ships, slightly reinforced with iron strips, not full steel armor.",
  "short_answers": [
   "Indefinitely",
   "The ships ran out of ammunition"
  ]
 },
 "Quora-283813": {
  "sentences": [
   "When you have no windows, you will have to create one."
  ],
  "full_text": "When you have no windows, you will have to create one. There is an option to create artificial window as per your choice with regard to view. You can choose a picture, print it to size, paste it on to a translucent plastic sheet which can be back lit with intensity of light changing starting with dawn - increasing to reach mid day - gradually reducing to end with sunset.",
  "short_answers": [
   "create one"
  ]
 },
 "Quora-059613": {
  "sentences": [
   "A large proportion of bigoted, homophobic or just plain stupid questions are posted by anonymous and a large portion of questions posed by anonymous are bigoted, homophobic or just plain stupid.",
   "Even when used for good questions, it detracts from the Quora community.",
   "But a huge portion of anonymous questions and answers do not need to be anon."
  ],
  "full_text": "Well, if you are talking about anonymity here on Quora, I dislike it for two sets of reasons. A large proportion of bigoted, homophobic or just plain stupid questions are posted by anonymous and a large portion of questions posed by anonymous are bigoted, homophobic or just plain stupid. Even when used for good questions, it detracts from the Quora community. There are times when anonymity is needed. Sometimes a question or answer could get a person in serious trouble or even killed. But a huge portion of anonymous questions and answers do not need to be anon.",
  "short_answers": [
   "questions posed by anonymous are bigoted, homophobic or just plain stupid",
   "it detracts from the Quora community",
   "a huge portion of anonymous questions and answers do not need to be anon"
  ]
 },
 "Quora-287006": {
  "sentences": [
   "one way to improve your creativity is to expand the sphere of your interests."
  ],
  "full_text": "one way to improve your creativity is to expand the sphere of your interests. Each week, challenge yourself to do something you would not normally consider. It doesn't have to involve big things either, it could simply mean eating a cheese you had always avoided. The reason for doing this is to ensure you never sink into a comfort zone where your creative urges are stifled by laziness and routine. Creativity thrives off new challenges; in many ways, they provide that part of your brain with invaluable exercise.",
  "short_answers": [
   "expand the sphere of your interests"
  ]
 },
 "Quora-254912": {
  "sentences": [
   "So to all those Quora newbies right here reading this I would recommend you to use the mute button Quora to block certain topics and people whom you feel are worthy of it."
  ],
  "full_text": "You see when you start using Quora you would find a lot of people whose opinion or some topics would not make sense to you or may probably anger you to some extent. However you find that the answer or topic has popular support among fellow Quorans and you reporting it would not do anything. Also by commenting against it you are susceptible to earn ire of those who support it and even get a BNBR warning depending upon how intensely you express your emotions. So to all those Quora newbies right here reading this I would recommend you to use the mute button Quora to block certain topics and people whom you feel are worthy of it. I am recommending this feature under little known tricks because I myself was a newbie user about a month ago and was very much pissed at the sight of some answer which gained sympathy among fellow Quorans for no reason. ",
  "short_answers": [
   "use the mute button Quora to block certain topics and people whom you feel are worthy of it"
  ]
 },
 "Quora-049861": {
  "sentences": [
   "Darth Vader was always a pilot at heart.",
   "When he wasn't in a life support chamber or a bacta tank sulking, Lord Vader liked spending his free time in his palace on Coruscant tinkering with his personal Tie-Fighter."
  ],
  "full_text": "Darth Vader was always a pilot at heart. As much as he would like to have acknowledged that Anakin Skywalker was dead, he still held onto his childhood passions. When he wasn't in a life support chamber or a bacta tank sulking, Lord Vader liked spending his free time in his palace on Coruscant tinkering with his personal Tie-Fighter. The pilot and the engineering genius never died inside of him and it was the one thing that brought him inner peace.",
  "short_answers": [
   "pilot",
   "oruscant tinkering"
  ]
 },
 "Quora-023968": {
  "sentences": [
   "The best way to kill the politicians is to be politician and beat them in thier own game.",
   "You beat them in politics,what is left is just a person no more politician."
  ],
  "full_text": "In today's world you can't just kill anyone .You will be caught and thrown into jail. Not just politician, Killing any one will ruin your life. The best way to kill the politicians is to be politician and beat them in thier own game. What/Who is Politician?“a person who is professionally involved in politics, especially as a holder of an elected office”. You beat them in politics,what is left is just a person no more politician. Enjoy killing Politician Now.",
  "short_answers": [
   "be politician and beat them in thier own game",
   "beat them in politics"
  ]
 },
 "Quora-139368": {
  "sentences": [
   "If your main priority is great battery life and performance then go for Redmi Note 4.",
   "If you don’t care about heating, camera lens getting scratches and below average battery life (almost half of competitors) but want great camera and latest Android updates than go for G4 Plus."
  ],
  "full_text": "If your main priority is great battery life and performance then go for Redmi Note 4. It also have much more sensors than G4 Plus. If you don’t care about heating, camera lens getting scratches and below average battery life (almost half of competitors) but want great camera and latest Android updates than go for G4 Plus. I won’t recommend G4 Plus, unless you love photography and you take photos in low light. In good light condition, Redmi Note 4 take decent shots.",
  "short_answers": [
   "great battery life and performance then go for Redmi Note 4",
   "great camera and latest Android updates than go for G4 Plus"
  ]
 },
 "Quora-217532": {
  "sentences": [
   "It's highly unlikely that there would be a cure for \"cancer.\""
  ],
  "full_text": "Don't believe everything you hear. People hear many things which are completely ridiculous and then believe them. Conspiracy theories sound believable because people present only the evidence for them, don't mention how these things are easily explained, and don't mention the evidence against them.\"... there is a cure for serious cancer ...\"Cancer isn't one disease. It's a cluster of diseases. It's highly unlikely that there would be a cure for \"cancer.\"",
  "short_answers": [
   "highly unlikely"
  ]
 },
 "Quora-215763": {
  "sentences": [
   "Like any genre that's new, rap takes time to appreciate.",
   "Many people don't like jazz because it too requires repeated exposure and careful listening.",
   "Rap is unique because you must listen to the words to understand it."
  ],
  "full_text": "Like any genre that's new, rap takes time to appreciate. Many people don't like jazz because it too requires repeated exposure and careful listening. Rap is unique because you must listen to the words to understand it. Without the words it has very little \"musical\" content (often simple beat, limited melodic or harmonic content). However, the words add complexity of rhythm and meaning. If you're listening to it as background, you probably won't get the words. I don't prefer it, but I can appreciate it.",
  "short_answers": [
   "that's new",
   "it too requires repeated exposure and careful listening",
   "Rap is unique"
  ]
 },
 "Quora-238488": {
  "sentences": [
   "We are disappointed, worried, sad.",
   "And we will never entirely trust you again."
  ],
  "full_text": "It’s rather like watching the person in the super hero costume take off their mask to reveal a disgusting pervert who kicks puppies and steals from charity collectors. We are disappointed, worried, sad. And we will never entirely trust you again. if you did this truly stupid thing, what else might you be capable of in the future?",
  "short_answers": [
   "disappointed, worried, sad",
   "we will never entirely trust you"
  ]
 },
 "Quora-238444": {
  "sentences": [
   "No Absolutely not.",
   "Cheaters do change, but not overnight, and becoming a faithful romantic partner is a symptom of becoming a better, more honest person in general."
  ],
  "full_text": "No Absolutely not. I have cheated in the past. Multiple times. For different reasons. I am now happily married to the uber-hub and would never cheat on him. I’ve had many opportunities. It’s not about getting caught - it’s about the person I have grown into and the value I place on my marriage. Cheaters do change, but not overnight, and becoming a faithful romantic partner is a symptom of becoming a better, more honest person in general.",
  "short_answers": [
   "No",
    "Absolutely not.",
   "Cheaters do change"
  ]
 },
 "Quora-198626": {
  "sentences": [
   "Honestly, I’d say that Black people don’t really have privilege, and on the racial hierarchy, it’s the worst thing to be."
  ],
  "full_text": "It is arguable. Many White people like to talk about affirmative action or how we can say the N-word but they can’t. Some Afrocentrics believe that we are blessed with the ability to stand in the sun or we are God’s chosen. Honestly, I’d say that Black people don’t really have privilege, and on the racial hierarchy, it’s the worst thing to be. In China, however, I felt like I had some privilege, but outside of a few curious girls, being Black wasn’t the reason, but rather being an English-speaking foreigner.",
  "short_answers": [
   "Black people don’t really have privilege",
   "it’s the worst thing to be"
  ]
 },
 "Quora-178361": {
  "sentences": [
   "Air-to-Air Missiles from other jets.",
   "Surface-to-Air from the ground."
  ],
  "full_text": "Air-to-Air Missiles from other jets.  Surface-to-Air from the ground. The AIM-9 Sidewinder, with over 250 kills, is likely the Air-to-Air missile with the most kills due to it’s age (it’s been around since the 50s) and the amount of countries that use it.",
  "short_answers": [
   "Air-to-Air Missiles",
   "Surface-to-Air"
  ]
 },
 "Quora-048930": {
  "sentences": [
   "Atheism is only the lack belief in any gods."
  ],
  "full_text": "Atheism is only the lack belief in any gods. Atheism and theism are mutually exclusive answers to the question, \"Do you believe in at least one god?\" If at any point the answer to the question is, \"No,\" or you don't know what a god is, you're an atheist at that time. If your answer changes, you're a theist. One can have an opinion on any other matter and still be an atheist. I don't believe there are any gods in me or anywhere else. I find peace with my family, in the love of my children and my husband.",
  "short_answers": [
   "the lack belief in any gods"
  ]
 },
 "Quora-091109": {
  "sentences": [
   "But I suggest backing up your data, gathering your install media for any programs you want to keep, and then re-installing the OS from scratch.",
   "I mean a full re-format and install."
  ],
  "full_text": "This is not what you want to hear... But I suggest backing up your data, gathering your install media for any programs you want to keep, and then re-installing the OS from scratch. I mean a full re-format and install. This is not me being a jerk; I try to do this at least once a year on my production systems. At the end of the day, there is no optimization like a fresh install. And, as @Ivan said, ZEALOUSLY try to keep the garbage off the system for as long as you can. If you don't need it, don't install it. Here's the thing: Windows has gotten a LOT better about isolating installations properly and cleaning up after uninstallations... but at the end of the day careless developers are careless developers -- big software houses and small. These \"artifacts\" add up, and that -- as well as unnecessarily running background processes and settings that you may have never intended to change -- are what causes the system to become sluggish. The best way to guard against this is to pay attention to what you are installing and, even then, to install \"responsibly\". My golden rule? Uninstall anything that you have the media for and that you don't use at least once a month. And do your best to stay away from the pirated stuff. ",
  "short_answers": [
   "re-installing the OS from scratch",
   "a full re-format and install"
  ]
 },
 "Quora-249009": {
  "sentences": [
   "I would go with William Marshal whose skill was well documented and acknowleded in Late Medieval Europe."
  ],
  "full_text": "I would go with William Marshal whose skill was well documented and acknowleded in Late Medieval Europe. Many other candidates we only know about through fairly apocryphal sources, but Marshal was recognized as the greatest jouster in Europe during his lifetime and won the respect in turn of Eleanor of Aquitaine, Henry II, Richard the Lion-Hearted and John Lackland (poor guy) for his prowess and loyalty. ",
  "short_answers": [
   "William Marshal"
  ]
 },
 "Quora-008873": {
  "sentences": [
   "The law in many western countries considers marriage to be a particular form of economic union.",
   "If the marriage ends, each spouse is entitled to 50% of the value acquired during marriage (less any debts acquired during that time)."
  ],
  "full_text": "The law in many western countries considers marriage to be a particular form of economic union. Most property acquired during the marriage accrues to the benefit of both spouses, as do their debts. If the marriage ends, each spouse is entitled to 50% of the value acquired during marriage (less any debts acquired during that time). Many jurisdictions now have no fault divorce, which means it doesn't matter why the marriage ended, nor does a court attempt to assign blame. It's over, and the assets of the marriage get divided up. And since the law applies equally to everyone, wives are treated no differently than husbands. So the cheating husband doesn't get any more or less either.",
  "short_answers": [
   "marriage to be a particular form of economic union",
   "each spouse is entitled to 50% of the value acquired during marriage"
  ]
 },
 "Quora-213489": {
  "sentences": [
   "The “Girl rating” algorithm you mentioned is Elo Rating Algorithm."
  ],
  "full_text": "Hey Ranjit,. The “Girl rating” algorithm you mentioned is Elo Rating Algorithm. If you listen carefully, Zuckerberg ask Selvin to give him the algorithm used to rank players in Chess. Hence ELO algorithm is used in chess rating of players. For detailed explanation you can read my blog on - Elo Rating System: Common link between Chess and Facemash",
  "short_answers": [
   "Elo Rating Algorithm"
  ]
 },
 "Quora-257232": {
  "sentences": [
   "There is a lot of time available for reading in everyone's life.",
   "Lying in bed at night is a traditional time for reading.",
   "If you commute on public transit, have a lunch hour without work to be done or friends to visit -- all good times."
  ],
  "full_text": "There is a lot of time available for reading in everyone's life. It's just a matter of making a decision that you are going to read rather than watch TV, play on the internet, garden, go to a movie, have dinner with a friend, or be with your children. Time -- and our inability to create any more hours in any day -- is the constant for every human being. So reading has to assume an importance in your life when compared to other competing demands. Since reading requires concentration -- it's practically impossible to multi-task if you are absorbed in a good book -- there will be times that are better suited to reading than others. Lying in bed at night is a traditional time for reading. If you commute on public transit, have a lunch hour without work to be done or friends to visit -- all good times. You can also set aside a time when you tell friends and family that it's your reading time -- then protect it and refuse alternative offers. In our over-scheduled lives, with crushing demands from all directions, always make time for yourself.",
  "short_answers": [
   "There is a lot of time available for reading",
   "Lying in bed at night",
   "commute on public transit, have a lunch hour without work to be done or friends to visit"
  ]
 },
 "Quora-033365": {
  "sentences": [
   "I would use YouTube as your tool of attracting a niche customer/fan base instead.",
   "You will receive a much greater and more consistent amount of money when you secure a deal with a business to sponsor your channel."
  ],
  "full_text": "I would say the best way to make money from YouTube isn’t from YouTube. I would use YouTube as your tool of attracting a niche customer/fan base instead. Unless you have consistent subscribers/viewers that total in the millions, it would be difficult to make any sort of substantive money. Even the most famous Youtubers don’t make THAT much money from YouTube itself. What these huge Youtube channels do have are people. These are people that are loyal to the Youtubers and will follow their recommendations. That’s why many channels partner or get sponsored by outside companies to make money. You will receive a much greater and more consistent amount of money when you secure a deal with a business to sponsor your channel.",
  "short_answers": [
   "YouTube as your tool of attracting a niche customer/fan base",
   "secure a deal with a business to sponsor your channel"
  ]
 },
 "Quora-056285": {
  "sentences": [
   "An abstraction can be applied to any specific circumstances that fit.",
   "Abstracting from many (many) specific examples, is computationally (brain-time) costly, probably on the order of 100x more difficult, and may lead to improper understandings and principles.",
   "Otherwise, class time is limited."
  ],
  "full_text": "An abstraction can be applied to any specific circumstances that fit. Abstracting from many (many) specific examples, is computationally (brain-time) costly, probably on the order of 100x more difficult, and may lead to improper understandings and principles. People taught by example will therefore tend to fail to apply the principles to new problems they haven’t seen before. People taught abstractions, will tend apply the abstraction to new circumstances, yielding correct solutions (solutions that work). Otherwise, class time is limited. Never believe you won’t use it again; if you believe you won’t use it again, you probably won’t, but if you learn it, you’re likely to move up to jobs and conditions that require it (and much, much more complex knowledge).",
  "short_answers": [
   "An abstraction can be applied to any specific circumstances that fit",
   "may lead to improper understandings and principles",
   "class time is limited"
  ]
 },
 "Quora-125172": {
  "sentences": [
   "It would be too costly, but there is a bigger reason not to launch nuclear waste into space: safety."
  ],
  "full_text": "It would be too costly, but there is a bigger reason not to launch nuclear waste into space: safety. Think about how many launch disasters there have been (Challenger) compared to how many overall launches. The failure rate may be good enough when the only lives at stake are those who willingly went aboard, but when there is a chance that an explosion in the atmosphere will disperse nuclear waste over a wide area, the failure rate must be much, much lower. Considering the volume of nuclear waste that would have to be sent up, there would have to be a lot more launches, which means the failure rate would have to be lower still in order to be publicly acceptable.",
  "short_answers": [
   "costly",
   "safety"
  ]
 },
 "Quora-086317": {
  "sentences": [
   "The common name would remain China.",
   "But there might be a dispute as to whether officially, it be called the People’s Republic of China (PRC) or the Republic of China (ROC).",
    "The previous is preferred by the mainland whereas the latter is used by the island."
  ],
  "full_text": "The common name would remain China. But there might be a dispute as to whether officially, it be called the People’s Republic of China (PRC) or the Republic of China (ROC). The previous is preferred by the mainland whereas the latter is used by the island. Regarding the unification it seems a distant dream, due to the existing differences in identity, philosophy and world position of the two nations (if we consider Taiwan a nation). And, both of them claim each other as a part of their own and claim to be the legitimate China. SO, the status quo would remain the same in the near future.",
  "short_answers": [
   "China",
   "People’s Republic of China (PRC)",
   "Republic of China (ROC)"
  ]
 },
 "Quora-114661": {
  "sentences": [
   "Often they sleep in afternoon classes after they have eaten lunch.",
   "Eating releases a cascade of hormones to help metabolize food, including serotonin, which can make you sleepy.",
   "Proteins especially make you sleepy, but also foods like bananas release melatonin, which can make you sleepy."
  ],
  "full_text": "It depends on when the student is sleeping. Often they sleep in afternoon classes after they have eaten lunch. Eating releases a cascade of hormones to help metabolize food, including serotonin, which can make you sleepy. Also the kinds of foods that a student eats will have differing effects. Proteins especially make you sleepy, but also foods like bananas release melatonin, which can make you sleepy. It's not all bad either. At least one study has shown that a post lunch nap increases alertness. Perhaps teenagers should have a scheduled nap time after lunch like some primary school children do. If you can't stop students from sleeping in afternoon classes, then maybe we should start planning for that entirely predictable effect.",
  "short_answers": [
   "they have eaten lunch"
  ]
 },
 "Quora-159377": {
  "sentences": [
   "They should stop cherry picking the teachings in the Bible and like taking the ones that serve their interests and dismissing those which don’t."
  ],
  "full_text": "They should stop cherry picking the teachings in the Bible and like taking the ones that serve their interests and dismissing those which don’t. Example: Bible asks Christians to be kind and forgiving, but most Christians (specially in the US and Europe) are pro wars and hateful people like our new so called president who takes pride in his faith. Not only he is not kind but he wants to nuke people he doesn’t like!Some Christians may argue that those people who are not kind and forgiving are not Christian. But according to Christianity, those who believe in Jesus ARE indeed Christians even if they have their own concept and interpretation of Christianity.",
  "short_answers": [
   "cherry picking the teachings in the Bible",
   "taking the ones that serve their interests",
   "dismissing those which don’t"
  ]
 },
 "Quora-294147": {
  "sentences": [
   "Take advanced classes as soon as you can.",
   "Avoid gossip and negativity AT ALL COSTS.",
   "Start taking your interests and hobbies seriously."
  ],
  "full_text": "Take advanced classes as soon as you can. Because of how math is tracked in many schools in the US, you'll only make it to calculus and advanced science classes if you finish algebra early in middle school. Avoid gossip and negativity AT ALL COSTS. Lost every adult you know has some middle school experience that haunts then… some occasion when they did something awful prompted by a desire to be seen as cool or funny. (Mine = chanting “fight” along with the other kids when a larger, popular kid decided to pick on a smaller kid with few friends to stand up for him. I'm 36 and still regret it). Start taking your interests and hobbies seriously. Your brain is in serious growth mode - take advantage of it now! Build robots, write novels, start baking, etc.",
  "short_answers": [
   "advanced classes",
   "Avoid gossip",
   "taking your interests and hobbies seriously"
  ]
 },
 "Quora-124740": {
  "sentences": [
   "May be because of the busy, competitive and internet addicted world?.",
   "Even if they make some friends, they are looked upon more as their competitors than buddies!."
  ],
  "full_text": "May be because of the busy, competitive and internet addicted world?. Well, I'm not sure, but these could be some of the reasons behind it!True friendship usually happens in childhood. But the problem nowadays is there's too much of competition in everything, right from the moment a child joins her/his kindergarten school. Every parent (or atleast a majority of them) wants their child to be a topper and the teachers also put pressure on their pupils to score high, for the sake of their school. In this process the child’s leisure or the playtime is lost. Children mingling with their peers and spending more time them, has become a rarity nowadays. Little time left after the school, homework and extracurricular activities (dance, music, karate classes etc), is spent on browsing or watching TV!Where's the time to make friends? So, forget about true friends!. Even if they make some friends, they are looked upon more as their competitors than buddies!. Thank you!",
  "short_answers": [
   "because of the busy, competitive and internet addicted world",
   "they are looked upon more as their competitors than buddies"
  ]
 },
 "Quora-138407": {
  "sentences": [
   "In most of the PSUs you will get managerial jobs only.",
   "Lastly i can say that you will learn mechanical,chemical,electrical what not everything , if you placed in a field location"
  ],
  "full_text": "In most of the PSUs you will get managerial jobs only. But there is always a scope to implement you knowledge. It may not be directly designing amplifiers or something .Most of the PSUs are moving towards automation, so your control systems knowledge will definitely useful there. Lastly i can say that you will learn mechanical,chemical,electrical what not everything , if you placed in a field location",
  "short_answers": [
   "managerial jobs",
   "mechanical,chemical,electrical what not everything"
  ]
 },
 "Quora-052692": {
  "sentences": [
   "Getting B’s or C’s will not work for Stanford, need to have very high grades and test scores.",
   "If you don’t have top grades, then you need to be a top athlete in some sport that the school wishes to recruit.",
   "Another helpful tip is if you are applying from an area that does not have alot of applications."
  ],
  "full_text": "I graduated from Stanford University for my undergrad. Getting B’s or C’s will not work for Stanford, need to have very high grades and test scores. And even with those it is not easy. I think it’s around 5% admission rate these days, and the fact that the school offers free tuition if your parents earn less than $90K a year has something to do with that. If you don’t have top grades, then you need to be a top athlete in some sport that the school wishes to recruit. The most surefire way to get in is…be the child of faculty. Seriously. Faculty brings in research dollars to the University and their children are on a different list for admission than others. Another helpful tip is if you are applying from an area that does not have alot of applications. Stanford likes to be geographically diverse. I applied while living in Minnesota, which meant that there was less competition. If you are applying from a state like California—well alot of people apply to stanford and it is more competitive.",
  "short_answers": [
   "high grades and test scores",
   "a top athlete in some sport",
   "applying from an area that does not have alot of applications"
  ]
 },
 "Quora-184673": {
  "sentences": [
   "An engine is a framework.",
   "It is the empty shell of a complete game, with all the content removed, waiting for the developer to provide code and artwork to complete the game."
  ],
  "full_text": "OpenGL and DirectX are APIs which concern themselves with efficiently drawing graphics. A game needs to do more than this. There are issues with loading assets, doing character animation, collision, materials and a million other things. An engine is a framework. It is the empty shell of a complete game, with all the content removed, waiting for the developer to provide code and artwork to complete the game. Additionally, engine vendors often supply authorship tools which assist in the  content-creation process.",
  "short_answers": [
   "a framework",
   "the empty shell of a complete game"
  ]
 },
 "Quora-171694": {
  "sentences": [
   "sweetie, never do the revenge on your ex.",
   "leave it to karma, people who do you wrong will get their rewards."
  ],
  "full_text": "sweetie, never do the revenge on your ex. leave it to karma, people who do you wrong will get their rewards. first, they have EXitted your life,theres nothing EXtraordinary about themthey are the EXtra thorn in your fleshso why waste your EXtra energy plotting to have them killed,leave it to god.",
  "short_answers": [
   "never do the revenge",
   "leave it to karma",
   "people who do you wrong will get their rewards"
  ]
 },
 "Quora-083200": {
  "sentences": [
   "You have to take responsibility for everything that happens to you."
  ],
  "full_text": "Being mature only means one thing. You have to take responsibility for everything that happens to you. How do you take responsibility? Here are two broad examples. Take ownership at your working place. A customer complaint? Tell the customer that you will look into it. Make sure you look into it and get back to the customer. You have a boss who does not understand you? Take the initiative to get to know your boss first. Spent time, talk and listen to the person. A team member messed up your project? Work with the team member to fix the problem. Avoid pointing fingers.",
  "short_answers": [
   "take responsibility for everything that happens to you"
  ]
 },
 "Quora-251411": {
  "sentences": [
   "You can certainly Argue it’s a result of U.S foreign policy.",
   "Not to mention, the CIA gave birth to Osama Bin Laden and breastfed his organisation during the 1980′s.",
   "Former British Foreign Secretary, Robin Cook, told the House of Commons that Al Qaeda was unquestionably a product of Western intelligence agencies."
  ],
  "full_text": "You can certainly Argue it’s a result of U.S foreign policy. If you look at history U.S has a record of backing Terrorist Groups. The CIA first aligned itself with extremist Islam during the Cold War era. Back then, America saw the world in rather simple terms: on one side, the Soviet Union and Third World nationalism, which America regarded as a Soviet tool; on the other side, Western nations and militant political Islam, which America considered an ally in the struggle against the Soviet Union. Not to mention, the CIA gave birth to Osama Bin Laden and breastfed his organisation during the 1980′s. Former British Foreign Secretary, Robin Cook, told the House of Commons that Al Qaeda was unquestionably a product of Western intelligence agencies.",
  "short_answers": [
   "it’s a result of U.S foreign policy",
   "CIA gave birth to Osama Bin Laden",
   "Al Qaeda was unquestionably a product of Western intelligence agencies"
  ]
 },
 "Quora-293090": {
  "sentences": [
   "The Sensex and Nifty are \"indices of a stock market\".",
   "The Sensex is an indicator of all the major companies listed on BSE(Bombay Stock Exchange) which is situated at Bombay.",
   "The Nifty is an indicator of all the major companies listed on NSE (National Stock Exchange) which is situated at Delhi."
  ],
  "full_text": "The Sensex and Nifty are \"indices of a stock market\". There are many other indices other than these indices. A stock market is a place where you can sell or buy shares or stocks of companies. An index is basically an indicator which gives us a general idea about stocks going up or down. The Sensex is an indicator of all the major companies listed on BSE(Bombay Stock Exchange) which is situated at Bombay. The Nifty is an indicator of all the major companies listed on NSE (National Stock Exchange) which is situated at Delhi.",
  "short_answers": [
   "indices of a stock market"
  ]
 },
 "Quora-097223": {
  "sentences": [
   "My personal recommendation is the You-Dont-Know-JS series by Kyle Simpson along with all of the associated video training that he does."
  ],
  "full_text": "My personal recommendation is the You-Dont-Know-JS series by Kyle Simpson along with all of the associated video training that he does. And the best part? It's all open-sourced on Github so you can read it online and make contributions if you feel the need to do so. In addition to that, the first book in the series, \"Up & Going\" is available in ebook format for free.",
  "short_answers": [
   "the You-Dont-Know-JS series by Kyle Simpson"
  ]
 },
 "Quora-115326": {
  "sentences": [
   "Nothing is wrong with you.",
   "We sleep more when we don't have any work as such."
  ],
  "full_text": "Nothing is wrong with you. We sleep more when we don't have any work as such. I used to sleep a lot and personally have broken many records. I din't have any work at that time. But now that i have work, i just sleep for 7-8 hours. The more you sleep, the more sleepy you will feel the whole day. After a certain point of time, the body refuses to get up even though our mind is already awake. Try waking up after 7-8 hours and you will feel refreshing and you wont feel lethargic. Your body and mind synchronize at that time. If you sleep for more than 8-9 hours, you will feel sleepy the whole day and won't be able to work actively.",
  "short_answers": [
   "Nothing",
   "don't have any work as such"
  ]
 },
 "Quora-121708": {
  "sentences": [
   "Kashmir already belongs to kashmiris and it is integral part of India at the same time."
  ],
  "full_text": "Kashmir already belongs to kashmiris and it is integral part of India at the same time. As others pointed out, if Pakistan wants a referendum in Kasmir then first they should back off from POK according to UN protocol. Pakistan is only trying to fool the Kashmiri youths.",
  "short_answers": [
   "Kashmir already belongs to kashmiris",
   "it is integral part of India"
  ]
 },
 "Quora-108254": {
  "sentences": [
   "Absolutely, and still do it now.",
   "The biggest thing gun wrapping, or just covering with a blanket, did was greatly reduce chances of a light glaring off the gun."
  ],
  "full_text": "Absolutely, and still do it now. It was trained in professional sniper classes in nations that keep them before WW2 started. The U.S. has shut it down and has to start from scratch when the war started. You rarely see pictures of the wrapped sniper rifles, because they were propaganda pictures. Snipers at war didn't bring a photographer with the flash with them out into combat. Plus, most of that was done after seeing the location they would be fighting in, designed to match the area. The biggest thing gun wrapping, or just covering with a blanket, did was greatly reduce chances of a light glaring off the gun.",
  "short_answers": [
   "Absolutely",
   "reduce chances of a light glaring off the gun"
  ]
 },
 "Quora-179188": {
  "sentences": [
   "Yes, your server will LOVE YOU to pieces if you pay the tip in cash!",
   "Cash is king and will make your server do a happy dance.",
   "I always tip cash if I am able to."
  ],
  "full_text": "Yes, your server will LOVE YOU to pieces if you pay the tip in cash! More often than not, a server can keep the cash tip that night. When a tip goes into a credit card a few things happen. First it is immediately taxed. The server will usually not get it until they get their paycheck in a week or two. Most restaurants are above board and will make sure the entire tip minus taxes goes to the server. Unfortunately, there are also instances when an establishment will take money out of the servers credit card tips to pay for repairs and services in the restaurant. This is illegal and while it is not the norm, it happens far more than it should. It has personally happened to me twice in two different establishments. The restaurant will over schedule the server to the point where they are not keeping track of their hours anymore and then quietly skim from their earnings. Occasionally payroll will make mistakes too. Cash is king and will make your server do a happy dance. I always tip cash if I am able to.",
  "short_answers": [
   "Yes",
   "Cash is king",
   "I always tip cash"
  ]
 },
 "Quora-068187": {
  "sentences": [
   "In english its called bootlicking.",
   "Become a political assistant of any high profile politician, you will be paid crores of black money packages."
  ],
  "full_text": "Chamchagiri/chaatomarg. In english its called bootlicking. Become a political assistant of any high profile politician, you will be paid crores of black money packages. Normal people get local bank account for monthly salaries, you my friend , will boast a foriegn swiss bank account. But with great packages comes great responsibility. The work is very tedious and soul sucking, you have to involve your self in hell lot of scams , rackets and religious propaganda to serve your political party interests. You will enjoy lot of perks and foriegn trips after toiling hard in election campaigns. On diwali , your boss will gift you unauthorised lands, MLA posts and hell lot of paper currency. Good thing is you , beyond all the side projects that will raise your bank balance exponentially, you can control your annual appraisal by 7th pay commission and give yourself an astounding 500% hike. Its a job that even Sundar Pichai would resign for.",
  "short_answers": [
   "Chamchagiri",
   "chaatomarg",
   "bootlicking"
  ]
 },
 "Quora-089071": {
  "sentences": [
   "The way I started off was to use an app like Synthesia to learn a simple tune.",
   "I would recommend to learn from sheet music though.",
   "Take it slowly and you will gradally make progress."
  ],
  "full_text": "Hey, I'm a beginner too. The way I started off was to use an app like Synthesia to learn a simple tune. It highlights which notes to play with which hand. I learnt a simple version of Beethoven’s Ode to Joy and Grieg’s In the Hall of the Mountain King this way. I would recommend to learn from sheet music though. Stop using the stickers as soon as you can. You need to make sure you don't become too dependent on them. It will take some time for you to find which notes to play but it's worth it. There are plenty of online resources which will teach you the basics of reading sheet music. The first piece I learnt purely from the sheets was Christian Petzold’s Minuet in G Major. Just remember to keep trying! Take it slowly and you will gradally make progress. Good luck!",
  "short_answers": [
   "use an app like Synthesia to learn a simple tune",
   "learn from sheet music",
   "Take it slowly"
  ]
 },
 "Quora-084136": {
  "sentences": [
   "This isolated and well defended piece of land makes it easy and secure to hold Taliban and Al-Qaeda prisoners without interference.",
   "If we were to hold them in an allied country we would have to contend with their courts and their rulings."
  ],
  "full_text": "Guantanamo Bay was leased from Cuba, starting in 1903. The current Cuban government has demanded that we return it (they refuse to cash the checks that pay for the lease, a true bargain at $4,085 annually) but do not have the means to force us to do so. This isolated and well defended piece of land makes it easy and secure to hold Taliban and Al-Qaeda prisoners without interference. If we were to hold them in an allied country we would have to contend with their courts and their rulings. We would not be in full control. If we brought them to the mainland we would have to contend with “not in my backyard” and security issues. So, we have GTMO, a complicated solution to a hard problem.",
  "short_answers": [
   "easy and secure to hold Taliban and Al-Qaeda prisoners without interference",
   "in an allied country we would have to contend with their courts and their rulings"
  ]
 },
 "Quora-060366": {
  "sentences": [
   "You just need to learn a few things first.",
   "Don’t worry about what the other guys do.",
   "Overcome shyness by asking three questions to anyone you are interested in."
  ],
  "full_text": "You just need to learn a few things first. Don’t worry about what the other guys do. Just figure out women. A good place to start is Men Are From Mars, Women Are From Venus by John Gray. My husband and I attended a workshop on this book when we first married and it really helped us. (We were both previously divorced). At minimum, READ the BOOK!. Overcome shyness by asking three questions to anyone you are interested in. It can be simple, like “Do you like the band?” or “Was that necklace a gift?”…..just something simple in the environment. DON’T ask “What time is it?” (I was asked that hundreds of times and thought they just wanted to know the time!) DUH!Learn ACTIVE listening. When someone says, “I got this necklace from Aunt Mildred”, you rephrase what was said….”OH, that's cool. Your Aunt Mildred has been generous with you.”",
  "short_answers": [
   "learn a few things",
   "Overcome shyness ",
   "Learn ACTIVE listening"
  ]
 },
 "Quora-111029": {
  "sentences": [
   "Then just follow the way of life suggested by Buddhism and you are a Buddhist!."
  ],
  "full_text": "No, its not at all difficult!If you are fed up of your current lifestyle already! Then just follow the way of life suggested by Buddhism and you are a Buddhist!. They believe in putting Harmony and Compassion above the Selfishness - so, be compassionate enough for every other living being - even plants and insects!Once you have resisted yourself by killing a mosquito which is biting your blood out for hours - You have converted your religion successfully!",
  "short_answers": [
   "follow the way of life suggested by Buddhism"
  ]
 },
 "Quora-048927": {
  "sentences": [
   "The short answer is yes, by any conventional definition of discrimination, treating one group differently than another group involves discrimination."
  ],
  "full_text": "It's a very complex issue. The short answer is yes, by any conventional definition of discrimination, treating one group differently than another group involves discrimination. With affirmative action, that discrimination is based on race.",
  "short_answers": [
   "yes"
  ]
 },
 "Quora-013502": {
  "sentences": [
   "The most reliable indicator is super-fluency with language."
  ],
  "full_text": "The most reliable indicator is super-fluency with language. Kids who can write and speak better English than your average CEO or Presidential Cabinet member when they are ten or eleven years old are way, way ahead of the game. On top of that, the real clicker is: can they use language cleverly? Kids who can create humorous turns of phrase that make you smile when they speak, are, by today’s severely dumbed-down standards, or any standards really, geniuses.",
  "short_answers": [
   "super-fluency with language"
  ]
 },
 "Quora-156974": {
  "sentences": [
   "Stop looking outward and look inward, into your heart.",
   "Money, so “they” say cannot buy happiness."
  ],
  "full_text": "Stop looking outward and look inward, into your heart. Money, so “they” say cannot buy happiness. However, it can buy power, “friends” and, yes, even so-called beauty. Being born into wealth and a privileged lifestyle, in and of itself, does not bestow upon you any of humanity’s most necessary and desirable characteristics, compassion, empathy and wisdom to name a few.",
  "short_answers": [
   "Stop looking outward",
   "look inward, into your heart",
   "Money, so “they” say cannot buy happiness"
  ]
 },
 "Quora-012681": {
  "sentences": [
   "No one who knows has said anything at all.",
   "Using “mean of parental IQs”, as the standard guess, Barron is likely in the 120 to 130 range."
  ],
  "full_text": "No one who knows has said anything at all. Even surmises about the President’s IQ are guesses. We do know that Donald’s siblings and relatives are bright,with a sister who was a Federal judge, and an uncle who was well-known as a physicist, inventor and professor. Using “mean of parental IQs”, as the standard guess, Barron is likely in the 120 to 130 range. His great-uncle was in the genius category of 135+, and such levels are not really well-adapted to numerical measurement, no matter what journalists claim.",
  "short_answers": [
   "No one who knows has said anything",
   "in the 120 to 130 range"
  ]
 },
 "Quora-279140": {
  "sentences": [
   "Much better quality of results due to the PageRank algorithm.",
   "Consideration for the user, in the form of a streamlined minimalist interface with non-intrusive ads."
  ],
  "full_text": "I think Google’s initial success is mostly attributable to two factors. Much better quality of results due to the PageRank algorithm. Consideration for the user, in the form of a streamlined minimalist interface with non-intrusive ads. Both of these were eventually copied by the competition but not fast enough, but as a result of these Google became a market leader, and from this point on it just needed to continue innovating at a normal rate to stay ahead of the competition.",
  "short_answers": [
   "Much better quality of results",
   "minimalist interface with non-intrusive ads"
  ]
 },
 "Quora-169525": {
  "sentences": [
   "Thankfully YES, otherwise I would have had a tough time over the years.",
   "Most women respond to the confidence that a guy has and his personality, so if you have a great personality, a sense of humor and a boat load of confidence, then you should have your pick of potential girlfriends."
  ],
  "full_text": "Thankfully YES, otherwise I would have had a tough time over the years. So, looks are about the last thing that really matter. Most women respond to the confidence that a guy has and his personality, so if you have a great personality, a sense of humor and a boat load of confidence, then you should have your pick of potential girlfriends. Looks fade over the years and are the least dependable of all the traits. Sure, young girls and generally women 29 and under may prefer good looks to anything else, but most women are looking for much more than just looks. Of course, you can always make a boat load of money and then you won’t have to worry about it, women will be throwing themselves at you but what you gain in quantity you lose in quality.",
  "short_answers": [
   "YES",
   "if you have a great personality, a sense of humor and a boat load of confidence, then you should have your pick of potential girlfriends"
  ]
 },
 "Quora-134277": {
  "sentences": [
   "Absolutely.",
   "Therefore gravity is indirectly powering any hydroelectric station.",
   "Tides are caused by gravity, and it is possible to generate power by harnessing tides."
  ],
  "full_text": "Absolutely.  We already do it in a roundabout way. Hydroelectric power, for example, harnesses the energy from flowing water to turn turbines.  Water flows because of gravity.  Therefore gravity is indirectly powering any hydroelectric station. Tides are caused by gravity, and it is possible to generate power by harnessing tides. It isn't especially hard to use gravity as an energy source.  The trick is that we have to exploit scenarios in which nature has already done the hard work of getting the water up high where it can flow down and we can steal its energy.",
  "short_answers": [
   "Absolutely",
   "hydroelectric station",
   "it is possible to generate power by harnessing tides"
  ]
 },
 "Quora-114459": {
  "sentences": [
   "Wikipedia is the only one of those platforms which strives to not be biased or opinionated."
  ],
  "full_text": "I don’t think the concept “biased” really can be applied to either Quora or Reddit - as both allow and encourage people to post their personal views and opinions, then of course many of those will be biased in various ways. Focusing on Reddit for a moment - it is organized into “subreddits” with local moderators for each one - so you get very pro- and anti- political subreddits which are very biased. Wikipedia is the only one of those platforms which strives to not be biased or opinionated. We succeed, more or less, to an extent, with natural human flaws.",
  "short_answers": [
   "Wikipedia"
  ]
 },
 "Quora-247218": {
  "sentences": [
   "The \"right\" religion is the one that serves you best, right up to the point that it tries to be imposed on everyone else."
  ],
  "full_text": "The \"right\" religion is the one that serves you best, right up to the point that it tries to be imposed on everyone else. Just because it is \"right\" for you does NOT mean that it's right for everyone else. Now if you ask me which religion is best for humanity, that is a whole different story. I am in favor of humanist religions such as those that actually follow the best teachings of other religions.  I am a member of a Unitarian Universalist Church. I find it offers the best combination of community, service, and advocacy of humanity. No gods required.",
  "short_answers": [
   "the one that serves you best"
  ]
 },
 "Quora-267452": {
  "sentences": [
   "In addition to the \"humans and apes evolved from a common ancestor\" answer, which is the key point, there's another misconception to tease out here: that evolution is a series of \"X is replaced by Y\" steps."
  ],
  "full_text": "In addition to the \"humans and apes evolved from a common ancestor\" answer, which is the key point, there's another misconception to tease out here: that evolution is a series of \"X is replaced by Y\" steps. It isn't. All that's required for a new variant of a species to emerge from an evolutionary process is for that variant to occur and survive over time. That can happen whether the ancestor species sticks around or not. What makes this non-obvious is that most species don't survive long-term; the vast, vast majority of species that have existed on Earth are extinct now. So if you look back, chances are that any given ancestor of any given modern species is long gone. But that's not necessarily because it was replaced per se. Rather, it probably coexisted for quite a long time with its descendant, gradually dying out for whatever reason (possibly, but not necessarily, including being outcompeted for scarce resources -- it's definitely true that competition plays a big role) until only the more recent species remained. Viewed from afar, this looks a bit like \"species A transformed into species B\" but that's just a conceptual shortcut, not the actual mechanism at work.",
  "short_answers": [
   "humans and apes evolved from a common ancestor",
   "another misconception to tease out here: that evolution is a series of \"X is replaced by Y\" steps. It isn't."
  ]
 },
 "Quora-178448": {
  "sentences": [
   "The extended right to abortion.",
   "The Romans consider it normal for a father to abort their children even after the birth."
  ],
  "full_text": "The extended right to abortion. We consider it normal for a mother to abort her unborn child. The Romans consider it normal for a father to abort their children even after the birth. A Roman Pater Familia had the right to kill anyone in his family. This was the case even if his child would be an adult man with an important office in the State.",
  "short_answers": [
   "right to abortion",
   "The Romans consider it normal for a father to abort their children"
  ]
 },
 "Quora-039559": {
  "sentences": [
   "For the starters it is not so easy to learn a bike with all the techniques first day you touch it.",
   "Secondly it needs practice and a sense of balance which no one can teach you and you should earn it all by yourself.",
   "Lastly,if you are passionate about riding you can do anything and ride any motorcycle."
  ],
  "full_text": "For the starters it is not so easy to learn a bike with all the techniques first day you touch it. Secondly it needs practice and a sense of balance which no one can teach you and you should earn it all by yourself. Lastly,if you are passionate about riding you can do anything and ride any motorcycle. I learnt to ride motorcycles 4 years ago in my 5th semester of Engineering and my first bike is an Enfield Electra 350.I go for riding every now and then at least cover over 1500Km. Just a matter of mind But trust me you are gonna love it. Wish you a safe ride :)",
  "short_answers": [
   "it is not so easy to learn a bike with all the techniques",
   "it needs practice and a sense of balance",
   "you can do anything and ride any motorcycle"
  ]
 },
 "Quora-052400": {
  "sentences": [
   "Working on NP-Hard problems is probably the most difficult because for that class of problems there is almost by definition no optimizing function that you can use to make life easier."
  ],
  "full_text": "Working on NP-Hard problems is probably the most difficult because for that class of problems there is almost by definition no optimizing function that you can use to make life easier. Usually you can come up with an optimization based on your theory and/or on your semantics and NP Hard problems are sort of looking at incredibly weak correlations without a theory. That’s a really difficult area to work in.",
  "short_answers": [
   "NP-Hard problems"
  ]
 },
 "Quora-265622": {
  "sentences": [
   "Rice is one of the most popular grains in the world, and it’s packed with a ridiculously high amount of energy.",
   "Rice contains many essential vitamins, such as thiamin and niacin."
  ],
  "full_text": "Rice is one of the most popular grains in the world, and it’s packed with a ridiculously high amount of energy. 100 grams of rice contains about 130 calories, and it’s a very inexpensive food to buy. Simply adding a generous portion of rice to your meal can add hundreds of extra calories. What’s more, it’s a very digestible grain with none of the gluten issues faced with wheat. Rice contains many essential vitamins, such as thiamin and niacin. It’s easy and quick to prepare, particularly if you have a rice maker. Meal tip: a rice and bean burrito is an energy packed, protein rich, healthy and delicious way to enjoy this grain.",
  "short_answers": [
   "Rice"
  ]
 },
 "Quora-258647": {
  "sentences": [
   "There is no known proof of Goldbach’s conjecture."
  ],
  "full_text": "There is no known proof of Goldbach’s conjecture. There’s a conjecture known as Goldbach’s weak conjecture, which states that every odd number greater than 5 is the sum of three primes. In 1937, Vinogradov proved that this is true for all sufficiently large odd numbers, and in 2013 Helfgott proved it completely, by lowering the threshold of “sufficiently large” to about 10271027, which is small enough to already have been covered by computer verifications.",
  "short_answers": [
   "There is no known proof"
  ]
 },
 "Quora-142650": {
  "sentences": [
   "Yes.",
   "If they make money, however, then ABSOLUTELY they should be taxed like any other business.",
   "Employees of the church should be taxed on their personal income just like anyone else."
  ],
  "full_text": "Yes. Churches are businesses. If the business operates as a non-profit, meaning that their income goes right back out in charitable ways, then they won’t be taxed because they didn’t make a profit. If they make money, however, then ABSOLUTELY they should be taxed like any other business. Employees of the church should be taxed on their personal income just like anyone else. If an employee of the church receives tangible assets (cars, homes, planes, etc.), those assets should be taxed.",
  "short_answers": [
   "Yes",
   "they should be taxed like any other business",
   "Employees of the church should be taxed on their personal income just like anyone else"
  ]
 },
 "Quora-269755": {
  "sentences": [
   "I have visited Pakistan a few times and I think it suffers from a bad reputation ; much of the country is relatively safe for white people, the locals are, by and large, very friendly and helpful.",
   "I have visited three places that were once accessible to tourists (and are not now) that have a reputation for danger: Landi Kotal (the Pakistan-Afghan border town in the Khyber Pass), Darra Adam Khel, and Kharkhani Bazaar."
  ],
  "full_text": "I have visited Pakistan a few times and I think it suffers from a bad reputation ; much of the country is relatively safe for white people, the locals are, by and large, very friendly and helpful. That said, it is well-known for instability and violence and in some areas, this reputation is justified. I have visited three places that were once accessible to tourists (and are not now) that have a reputation for danger: Landi Kotal (the Pakistan-Afghan border town in the Khyber Pass), Darra Adam Khel, and Kharkhani Bazaar. The first two were actually relatively safe, as there were significant numbers of Tribal Areas Police present (in the Khyber, I was escorted) but Kharkhani, there were few white visitors and few police : a very insecure environment.",
  "short_answers": [
   "Pakistan",
   "Landi Kotal (the Pakistan-Afghan border town in the Khyber Pass), Darra Adam Khel, and Kharkhani Bazaar"
  ]
 },
 "Quora-132023": {
  "sentences": [
   "They aren't strong they're organised and focused but if a side were to break that concentration they would have a good chance of being Chelsea."
  ],
  "full_text": "They aren't strong they're organised and focused but if a side were to break that concentration they would have a good chance of being Chelsea. But on top of that they have won when they are expected to win going into every game with the same level of respect for each side.",
  "short_answers": [
   "they're organised and focused"
  ]
 },
 "Quora-242969": {
  "sentences": [
   "In my lifetime Richard Nixon.",
   "However, overall probably the most despised President was Andrew Johnson."
  ],
  "full_text": "In my lifetime Richard Nixon. This was because of the Vietnam War. However, overall probably the most despised President was Andrew Johnson. Johnson succeeded Lincoln after his assassination. He was not a radical Republican and did not want to be tough on the South. He was former Democrat and slave owner and wanted to be conciliatory to the South. Because of that the Radical Republicans under Thaddeus Stevens of Pennsylvania were out to get Johnson. When Johnson fired Seward they called for his impeachment. Johnson dodged impeachment by one vote in the Senate. He was also considered a drunk (he was drunk on inauguration day in 1864) and incompetent. He did not run for reelection.",
  "short_answers": [
   "Richard Nixon",
   "Andrew Johnson"
  ]
 },
 "Quora-084693": {
  "sentences": [
   "No, that is entirely false.",
   "I eat meat as part of a balanced and varied diet."
  ],
  "full_text": "No, that is entirely false. I have worked in a meat processing plant with slaughterhouse for years. I am not a tribesman, violent, or psycho. I eat meat as part of a balanced and varied diet.",
  "short_answers": [
   "false",
   "I eat meat"
  ]
 },
 "Quora-004219": {
  "sentences": [
   "The best way to learn Guitar faster is to invest a good amount of time in practicing the Scales."
  ],
  "full_text": "The best way to learn Guitar faster is to invest a good amount of time in practicing the Scales. Yes, it doesn't sound like it makes sense, but believe me - when you scale up on speed and precision - automatically you will be comfortable to move from one scale to the other, It also helps you in creating accurate notes while picking. You might wonder how 'Scales' could probably help - this is because you are so familiar with make accurate sounds, your skill of picking, sliding, hammer-ons & pull-offs become almost effortless. You also might want to practice a lot to learn faster. If you like a song, go over the chords again and again. Practice is vital & the sure-shot way to learn faster and better. In the end - what matters is how accurate you are with the note, transition from one chord to the next & create melodious rhythm while strumming.",
  "short_answers": [
   "invest a good amount of time in practicing the Scales"
  ]
 },
 "Quora-075976": {
  "sentences": [
   "Since this person is your parent, I would call them whatever they asked to be called.",
   "So if they ask to be called mom, dad, or Bridget Jones, I would hope that you would call them whatever they wished to be called."
  ],
  "full_text": "Since this person is your parent, I would call them whatever they asked to be called. Hopefully the relationship you have with your parent is one of respect and intimacy. So if they ask to be called mom, dad, or Bridget Jones, I would hope that you would call them whatever they wished to be called. Often it's more confusing for you then it is for them. Ask. It's the easiest way to end the confusion.",
  "short_answers": [
   "whatever they asked to be called",
   "whatever they wished to be called"
  ]
 },
 "Quora-150464": {
  "sentences": [
   "This concept does exist.",
   "It does happen."
  ],
  "full_text": "This concept does exist. My grandparents met at a drive in....in the 50's. My grandmother wrote her number on a window, my grandpa called her and it was love at first sight. They died within 3 days of each other, raised 4 amazing intelligent successful children and lived into their mid eighties. It does happen. Now, it RARELY happens like that and RARELY lasts.  Compatibility and going the same direction is huge in life. This is important. Take the time and get to know her. Then we shall see if this is love.",
  "short_answers": [
   "This concept does exist",
   "It does happen"
  ]
 },
 "Quora-284598": {
  "sentences": [
   "Time is the 4th dimension of the universe, Time and space are interwoven, hence the phrase “Space-Time”."
  ],
  "full_text": "There is no concrete way to explain it because simply, We do not know much about it. Time is the 4th dimension of the universe, Time and space are interwoven, hence the phrase “Space-Time”. It is this thing that cannot be measured or interacted with physically, yet it affects every single thing in the universe. Since space and time are woven together and space is warped, time is relative(as pointed out by Einstein in his theory of special relativity). Also, Time moves at the speed of light.",
  "short_answers": [
   "the 4th dimension of the universe"
  ]
 },
 "Quora-051863": {
  "sentences": [
   "I do nothing unless that person is harassing me and/or people I know.",
   "Then, and only then, will I block & report."
  ],
  "full_text": "I do nothing unless that person is harassing me and/or people I know. Then, and only then, will I block & report. I think that it's certainly odd, I agree. But I cannot force people to stop doing the same things I am doing. It is not flattering, but it certainly doesn't put anyone at risk. I follow 43 people as of right now. Not every person I follow appears in my feed, for some odd reason. I like going to their profiles & upvoting some of their answers, since I rarely see them. And I follow people for a reason. Being \"stalked\" doesn't bother me as much as being \"hunted,\" per se. They can stalk all they want, but they are not allowed to go any further.",
  "short_answers": [
   "I do nothing",
   "I block & report"
  ]
 },
 "Quora-246978": {
  "sentences": [
   "I think she is weak for a conservative, she's too liberal in my view."
  ],
  "full_text": "I think she is weak for a conservative, she's too liberal in my view. Really she strikes me as being an interim type leader, a person who will carry the party forward till a more effective leader is found. But to be honest I don't think she will be replaced, she will probably stay a good while.",
  "short_answers": [
   "she is weak for a conservative",
   "she's too liberal"
  ]
 },
 "Quora-081099": {
  "sentences": [
   "Because that will result in an unpleasant and undesirable consequences.",
   "Other countries will considered that China does not have the ability to protect the sovereignty of its own country and that they would seek their chances to claim one of the Chinese land to be theirs or even start a war.",
   "So it is of crucial importance for the Chinese government to insist that Taiwan is just a province of China, not a country."
  ],
  "full_text": "Because that will result in an unpleasant and undesirable consequences. Taiwan would only be a case. If the Chinese government allow Taiwan to be a separate country, the consequences will be that regions like Hong Kong or Xinjiang or Tibet will follow this behaviors. And that it would threaten the reputation of China and the local people. And it does not only have effects over the regions. It has those that affect China when it comes to international relationships. Other countries will considered that China does not have the ability to protect the sovereignty of its own country and that they would seek their chances to claim one of the Chinese land to be theirs or even start a war. So it is of crucial importance for the Chinese government to insist that Taiwan is just a province of China, not a country.",
  "short_answers": [
   "unpleasant and undesirable consequences",
   "they would seek their chances to claim one of the Chinese land to be theirs or even start a war",
   "it is of crucial importance for the Chinese government to insist that Taiwan is just a province of China"
  ]
 },
 "Quora-204877": {
  "sentences": [
   "I think a French exit would be he death knell for the EU.",
   "With them gone the dominoes start to fall"
  ],
  "full_text": "I think a French exit would be he death knell for the EU. Nobody in Europe is really that worried about the British exit other than the fact we pay in far more than we get out (about £250 million). France on the other hand is one of the founder members and also, with Germany, controllers of the EU. With them gone the dominoes start to fall",
  "short_answers": [
   "death knell for the EU",
   "the dominoes start to fall"
  ]
 },
 "Quora-150818": {
  "sentences": [
   "It takes time, lots of time.",
   "What helped was talking to a trusted friend who told me I deserved a lot better than a liar."
  ],
  "full_text": "It takes time, lots of time. I have been there. There’s nothing quite like being rejected by someone who has sworn undying love only to leave the very next day. It took me over a year to get over it. What helped was talking to a trusted friend who told me I deserved a lot better than a liar.",
  "short_answers": [
   "It takes time",
   "I deserved a lot better"
  ]
 },
 "Quora-222140": {
  "sentences": [
   "They had already completed filming Episode VIII, so they won't need Carrie Fisher for that.",
   "Star Wars has obsessively used the same actors to play characters, and when those actors weren't available, they used CGI (Leia and Tarkin in Rogue One)."
  ],
  "full_text": "They had already completed filming Episode VIII, so they won't need Carrie Fisher for that. Star Wars has obsessively used the same actors to play characters, and when those actors weren't available, they used CGI (Leia and Tarkin in Rogue One). If they need Leia for Episode IX, they may use CGI. As far as Episode IX is concerned they will probably have the character Princess Leia be killed off-screen in either VIII or in the transition between VIII and IX.",
  "short_answers": [
   "they won't need Carrie Fisher for that",
   "they used CGI"
  ]
 },
 "Quora-251010": {
  "sentences": [
   "No doubt at all - The current reservation system is bad for India.",
   "If a system/process fails to achieve in 60 years what it was supposed to.… then it is a clear case of failure."
  ],
  "full_text": "No doubt at all - The current reservation system is bad for India. If a system/process fails to achieve in 60 years what it was supposed to.… then it is a clear case of failure. And why do I say that it failed to achieve its original intent....that is because even after so many years of introducing this reservation system, we still have/need reservations today. It might have helped in upliftment of a few people , however, definitely not to the masses it was supposed to.",
  "short_answers": [
   "The current reservation system is bad",
   "clear case of failure"
  ]
 },
 "Quora-250854": {
  "sentences": [
   "Then that means that you’re just an attractive person — either body-wise or personality-wise, to those girls."
  ],
  "full_text": "Then that means that you’re just an attractive person — either body-wise or personality-wise, to those girls. Don’t worry about your height… 5′5″ isn’t that short (it’s taller than me, anyway) and, besides, height doesn’t matter that much in a relationship.",
  "short_answers": [
   "you’re just an attractive person"
  ]
 },
 "Quora-047328": {
  "sentences": [
   "Yes, you can build muscle with light weights."
  ],
  "full_text": "Yes, you can build muscle with light weights. But, after lifting light weights for a long period of time, your muscle start to grow more slow than they should or stop growing at some point. In order to make your muscle grow constantly, you need to lift heavier weights at the gym. Start with some light weights for some weeks and then start adding weight when your body is used to that weight.",
  "short_answers": [
   "Yes"
  ]
 },
 "Quora-231794": {
  "sentences": [
   "Therapies indicated for treatment of gynophobia include exposure therapy, behavioral therapy, talk therapy, CBT or cognitive behavioral therapy.",
   "Speak with your parents about seeing your doctor who can refer to an appropriate specialist."
  ],
  "full_text": "Gynophobia is a fear of women. the earlier the precipitating events such as in childhood, the more difficult the disorder is to treat. The disorder is often mistaken for social anxiety but they differ in one main respect. With social anxiety the individual may fear everyone. With gynophobia the individual fears only women. The symptoms can include excessive sweating Nausea, difficulty with breathing and a shortness of breath. You mentione4d anxiety attacks. Therapies indicated for treatment of gynophobia include exposure therapy, behavioral therapy, talk therapy, CBT or cognitive behavioral therapy. Speak with your parents about seeing your doctor who can refer to an appropriate specialist. http://www.simplypsychology.com Thanks for the request.",
  "short_answers": [
   "exposure therapy, behavioral therapy, talk therapy, CBT or cognitive behavioral therapy",
   "refer to an appropriate specialist"
  ]
 },
 "Quora-287338": {
  "sentences": [
   "I think it's extreme, heartless, and idiotic, and I'm saddened by and ashamed of it."
  ],
  "full_text": "I think it's extreme, heartless, and idiotic, and I'm saddened by and ashamed of it. I was raised on stories of victims of religious or political persecution immigrating to the US. My heroes were those legendary brave people journeying to a new land where they would find safety and prosperity. My own grandparents are immigrants, and my great-grandparents were refugees who fled their native land so they could continue to practice their religion.",
  "short_answers": [
   "extreme",
   "heartless",
   "idiotic"
  ]
 },
 "Quora-050486": {
  "sentences": [
   "Unfortunately, yes.",
   "Most of it’s due to the rise of secular humanist ethics and, along with them, the cancerous post-modernist philosophy: “Nothing really matters, so if it feels good, do it!."
  ],
  "full_text": "Unfortunately, yes. Most of it’s due to the rise of secular humanist ethics and, along with them, the cancerous post-modernist philosophy: “Nothing really matters, so if it feels good, do it!. Most of this is fed by these movies and sitcoms in a vicious cycle that breaks down the meaning of true relationships and degrades humans to nothing more than animals with meat computers. All in all, Western society is going down the toilet. As Ifeoluwapo Eleyinafe put it in a comment a little while ago: “My vote is for [Western civilization] flying off the handle. Once words begin to degrade, it’s only a matter of time. Once truth is forgotten and no one is humble before it or fighting for it, it’s only a matter of time.”",
  "short_answers": [
   "yes",
   "the rise of secular humanist ethics",
   "the cancerous post-modernist philosophy"
  ]
 },
 "Quora-248979": {
  "sentences": [
   "Permanently.",
   "Fingerprints are corrosive and can and do etch steel.",
   "It seems that the higher the polish the easier it is to leave a permanent one."
  ],
  "full_text": "Permanently. Fingerprints are corrosive and can and do etch steel. They will also etch brass. They don’t always. It seems that the higher the polish the easier it is to leave a permanent one. Not all people run at the same ph, so some are more corrosive than others but anyone can leave one. The oils etc that make them up will dry up eventually but it is still possible to detect them even if they don’t etch in. Fume them with hot cyanoacrylate and they will turn up on wood, metal or even skin. They turn up a lot on magazines because they get loaded bare handed and crammed into the bottom and left. I have seen fingerprints under the wood from whoever had it apart last, who knows how old they are? The good part is if you wipe it down after you fire and clean it, none will be left, Hoppe's number nine takes them right off and so does Breakfree.",
  "short_answers": [
   "Permanently",
   "Fingerprints are corrosive",
   "the higher the polish the easier it is to leave a permanent one"
  ]
 },
 "Quora-254019": {
  "sentences": [
   "It wasn't seen as sexual because they're little kids.",
   "It was unheard of to think that a short skirt would be seen sexually rather than as something for a kid to run around in and get dirty."
  ],
  "full_text": "It wasn't seen as sexual because they're little kids. Look at the boys' shorts from that era, as they go pretty short, too; it's simply not sexualized because their bodies are considered undeveloped. Rather than being hyper-aware of sexuality, the fifties were more obtuse about it. It was unheard of to think that a short skirt would be seen sexually rather than as something for a kid to run around in and get dirty.",
  "short_answers": [
   "It wasn't seen as sexual"
  ]
 },
 "Quora-089106": {
  "sentences": [
   "Well the easiest way, which may not produce results, is to upload it to  the Google Image Search engine."
  ],
  "full_text": "Well the easiest way, which may not produce results, is to upload it to  the Google Image Search engine.  Google will make an attempt to find the  image that looks similar or if there is any EXIF (Exchangeable image file format)  data embedded in the photo, it will search by that data.  It will also list any similar images that google finds below any exact results. In order for this to work, the image has to be index in the google search engines so if a photo is recently uploaded it would not even appear for a while.  More so, it may take time for that image to spread socially and be tagged with more information about who the subject may be.  However if the subject is never mentioned and it is not self evident by the page that the images is hostel on, then there is no technical way of knowing.  You will then have to become a photo sleuth. You would have to find something else out about the photo, where was it taken, during what event, what other descriptive things are found in the picture that can be searched. ",
  "short_answers": [
   "Google Image Search engine."
  ]
 },
 "Quora-293378": {
  "sentences": [
   "It is possible and can be beneficial to both languages you're trying to learn.",
   "However, this will not work on all two language combinations."
  ],
  "full_text": "It is possible and can be beneficial to both languages you're trying to learn. However, this will not work on all two language combinations. Me and my friend studying Mandarin and Japanese at the same time. They are two very different languages with different writing systems and totally different grammar structures. Not to mention, one is a strictly tonal language and the other is not. Despite all the huge differences there are undeniable similarities in logic of writing and some words since the Japanese language has been greatly influenced by the Chinese language. It may be confusing at some point, but if you take advantage of the differences and similarities, it's greatly possible. It's easy to remember the rules when you compare it to another language.",
  "short_answers": [
   "possible and can be beneficial"
  ]
 },
 "Quora-057023": {
  "sentences": [
   "Coming from another teen here, I think that your dad doesn’t need to tell you if they are dating for a few weeks, but he should be disclosing the information if it is a serious relationship.",
   "However, if he is bringing her over, yes he should absolutely be telling you."
  ],
  "full_text": "Coming from another teen here, I think that your dad doesn’t need to tell you if they are dating for a few weeks, but he should be disclosing the information if it is a serious relationship. However, if he is bringing her over, yes he should absolutely be telling you. Think of it like this, what if it’s the middle of the night and she’s using the bathroom. You don’t recognize the physical appearance and believe it to be a home intruder. Worst case scenario, you hurt his girlfriend. Even if you met her before the “sleeping” then your dad should have at the least, told you before she came over so you were prepared. Don’t confront him, but just let it out sometime in conversations casually so he gets the idea.",
  "short_answers": [
   "he should be disclosing the information if it is a serious relationship",
   "if he is bringing her over, yes he should absolutely be telling you"
  ]
 },
 "Quora-103002": {
  "sentences": [
   "I don't think so they are fairer.",
   "They are not any different from rest of Indians."
  ],
  "full_text": "I don't think so they are fairer. I lived in Muscat and went to school with a large number of malayalis. They are not any different from rest of Indians. They are talked about a lot now because they are dominating southern cinema. Some actress are fair and some are dusky. Fair or dusky they are beautiful and talented.",
  "short_answers": [
   "I don't think so",
   "They are not any different"
  ]
 }
}